[
    {
        "id": 1,
        "title": "The Lightless Stars",
        "excerpt": "Diving into the mystery surrounding black holes, including what they are and how they're formed in an engaging and curious manner.", 
        "category": ["Physics", "Astronomy"],
        "author": "Ansh Sharma",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image1.png",
        "date": "2025-08-02",
        "content": "Just like many others, I spent my childhood gazing up at the glittering sky — full of stars, constellations, and planets. Back then, I believed space was perfect: ideal, beautiful, and unblemished… until I learned about a terrifying stain. \n\nInvisible, ravenous beasts that would consume anything daring enough to cross their path. \n\nCreatures straight out of science fiction — but frighteningly real. \n\nThe monsters of the cosmos. \n\nThe fallen stars. \n\nThe devourers of light. \n\nBlack Holes. \n\nThe paradoxes of nature itself, black holes, are shrouded in more than just darkness. The mystery of these monsters started with a simple equation and led to the discovery of seemingly missing patches of space. To this day, these gaping voids confound the minds of even the greatest physicists with the innocent yet cruel question: What are black holes— and how exactly are they created? \n\nBlack holes, despite their name, aren’t holes at all. Their tremendously dense remnants are left behind from collapsed stars. A star is created when its core’s gravity draws together enough dust and gases to ignite nuclear fusion. This reaction generates incredible amounts of energy, heating up the material and causing it to expand outwards. The result is a constant battle with the gravity of the star’s core, which greedily pulls it in, and the matter, which makes every effort to break for. \n\nImagine a balloon where the air desperately attempts to escape the rubber skin that continuously pulls it back in. Inevitably, when the fuel for nuclear fusion runs out, the star has no more energy to expand outwards and collapses in on its core. \n\nIn the case of extremely massive stars, known as high-mass stars, the star goes through a reaction known as a supernova that causes all the matter to explode outwards, leaving the core alone in space. Now, if a particularly massive star—more than 25 times the mass of our Sun —collapses, the core that is left behind is so dense that its gravity doesn’t allow even light to escape its clutches. \n\nThus, a black hole is born. \n\nAfter the birth of a black hole, the surrounding space falls into turmoil. The black hole’s gravity draws in surrounding matter, as well as light, creating a dark, seemingly empty patch of space. Most of the matter that is drawn in starts spiraling into the black hole, creating a hot, glowing disk of debris, dust, gases, and other matter, known as an accretion disk. Because black holes emit no light and draw in any form of electromagnetic radiation, these disks are the only way scientists can detect them. As these disks orbit the black hole, they heat up to millions of degrees, making them glow and emit various types of radiation, unveiling the location of these otherwise undetectable chasms. \n\nA common question is what would happen to any object—or person—unfortunate enough to fall into a black hole’s gravitational field. Firstly, as the object approaches the event horizon, time starts behaving strangely. The event horizon is ominously, yet fittingly named the point of no return, and isn’t a physical surface but rather a boundary in the spherical space of the black hole where anything, not even light, can escape due to the intense gravity (Note: gravity increases the closer you get to an object). Near this edge, the gravity of the black hole starts causing something known as gravitational time dilation: A drastic slowing of time when compared to a distant observer. For the object inside the gravitational field, time would slow down so significantly that mere minutes would correspond to centuries for any distant bystander. This phenomenon only grows as a person nears the core of the black hole, otherwise known as the singularity. \n\nIn addition to time dilation, the object would also experience spaghettification — a dramatic stretching caused by the intense gravitational disbalance near a black hole. The side closer to the singularity would experience a significantly stronger gravitational pull than the side further away, creating an effect so powerful it would stretch the object into a long, thin strand — like spaghetti. \n\nNow, one of the greatest mysteries of black holes is the nature of their cores, known as singularities. These singularities compress a finite amount of mass into an infinitely small space. Around these cores, the laws of classical physics and quantum mechanics, as we know, cease to function in predictable or logical ways. \n\nThis breakdown challenges many scientific equations, with one of the notable ones being the equation E=mc2. This equation, created by the genius Albert Einstein, relates an object’s mass to energy. If one were to naïvely substitute in the infinite density of a singularity in place of mass, the solution would imply infinite energy — something forbidden in the framework of physics. \n\nThis paradox provides a glimpse of the strange nature of singularities and indicates the need for a unified theory that can balance physics with the existence of black holes. \n\nA key step in solving these mysteries and logical flaws stems from directly observing black holes. As mentioned before, since black holes do not emit light or any form of electromagnetic radiation, traditional means of observation yield no results. Instead, scientists carefully detect the radiation released from the accretion disks, or the large gravitational waves that are released during the collision of two black holes — a phenomenon first confirmed by LIGO (a large-scale physics observatory designed to detect gravitational waves) in 2015. \n\nThese observations have revealed that black holes come in various sizes: \n\n· Stellar (3-100 solar masses) * \n\n· Intermediate (hundreds-thousands of solar masses) \n\n· Supermassive (millions to billions of solar masses) \n\n· Primordial (hypothetical remnants from the Big Bang). \n\n* 1 solar mass = 1.989×1030 kg \n\nThis wide variety of sizes leads scientists to believe black holes grow through various processes. The current leading theories involve either the black hole drawing in surrounding matter or merging with other black holes. While these ideas hold up when tested with models and indirect observations, a clear explanation still eludes physicists. \n\nA more mystifying theory comes from the famous scientist Stephen Hawking, who theorized in 1974 that black holes may not only grow, but also decay. This is possible through something known as Hawking Radiation, an occurrence where black holes create virtual particle pairs at the edge of their event horizon, due to quantum fluctuations. One of these particles falls into the singularity, while the other escapes as radiation, causing the black hole to shrink in size. This brings about the prospect that over an extended period, a black hole could potentially disappear. \n\nThe idea that something as immense and powerful as a black hole could vanish challenges our understanding of not only these abysses but also our understanding of the universe itself. It raises more questions than it answers that remain hidden from our senses, yet illuminated by the divine vision of mathematics, the language of the universe. \n\nAnd even then, these questions only scratch the surface of secrets these voids hide. \n\nOther notions—information paradox, the breakdown of quantum physics around singularities, or white holes, the opposite twins of black holes—continue to humble scientists, reminding us about how much we still have left to unveil. \n\nThese dark, mysterious, and terrifying enigmas test the limits of what we know, tugging at the very fabric of time, space, and reality as we know it. \n\nWe may never truly understand these cosmic chasms. \n\nBut we can try."
    },
    {
        "id": 2,
        "title": "Machine Learning: The Best Data Analyzer",
        "excerpt": "Machine learning (ML) is a subset of artificial intelligence that is able to learn patterns and correlations in data.",
        "category": ["Technology", "Artificial Intelligence"],
        "author": "Ayush Srivastava",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image2.jpg",
        "date": "2025-7-29",
        "content": "Have you ever opened YouTube or Instagram to watch a few shorts or reels for just 5–10 minutes, only to find yourself still scrolling two hours later? It’s shocking how platforms like Instagram and YouTube are able to deliver videos so perfectly tailored to your interests. It almost feels like they know exactly what you want to watch. In reality, that’s machine learning at work, tracking which videos you spend the most time on and then pushing more content based on your viewing patterns. \n\nEvery time Netflix suggests your next binge, or your phone predicts the next word you are about to type, you're seeing machine learning in action. \n\nMachine learning is often a foreign concept to many, yet it is integrated into numerous applications we use daily. Various social media platforms, videos on YouTube, and even products on Amazon utilize machine learning. This subset of artificial intelligence has quietly positioned itself close into the center of our lives, enabling us to interact with it daily.\n\nThe realm of artificial intelligence includes numerous subfields, one of which being machine learning. Machine learning allows systems to actually learn patterns and correlations from data and make predictions and decisions based on what they receive. Machine learning can be used to analyze huge amounts of data to determine patterns or trends in an extremely short amount of time - in fact, the more amount of data the machine learning algorithm contains, the more likely its accuracy will increase. \n\nMachine learning is a learning process that is achieved through the implementation of machine learning models. These models are no more than mathematical formulas - usually complex ones which we don’t need to delve into. These models analyze large amounts of data to improve their prediction accuracy and performance over time without being explicitly programmed. A simple way to think about it is this: imagine a scenario where a small child must classify planes and cars. Rather than just instructing the child that planes have wings, a long body, a tail, and can fly, while cars are much smaller, have no wings or tail, and do not fly, the child is instead given hundreds or thousands of images of either cars or planes. Over time, as the amount of data grows, the child is able to recognize and detect these differences between the car and the plane. This is the heart of machine learning. The ML models learn from the data they’re given through two main learning processes. \n\nThe first method is supervised learning. In this method of learning, all of the data contains labels. Going back to the car vs. plane example, if a ML model was given this data and told to analyze it with supervised learning, all of the data would contain labels, such as “car” or “plane.” The model is able to easily identify which picture is a car or plane based on the label and, through this, is able to detect any differences between the car and the plane and classify accordingly. Numerous practical applications exist for this method of learning for ML models, including medical diagnosis, fraud detection, marketing, and more. \n\nThe second method is through unsupervised learning, which is the exact opposite of supervised learning. In unsupervised learning, labels do not exist for the data - indicating that when the data is passed to the model, the model does not know the labels. The ML model must be able to detect any hidden patterns, correlations, or relationships without any prior experience or examples. Imagine an adult working to analyze consumer spending behaviors. This adult mainly specializes in finding sets of items that are bought together or occur frequently together in consumer purchases. The adult would predict that, the majority of the time, consumers buy bread and butter together at the store. Obviously, the relationships that must be determined are much more complex than the one just given - or else why would one need this learning method of machine learning? In this method, the model teaches itself the similarities, differences, and groupings within the dataset. Applications for this method of machine learning include clustering of people based on their types of behavior in different situations (e.g. purchasing, panic, etc.), aiding in customer segmentation for businesses, along with detections in cybersecurity, and even genomic data analysis. \n\nNow, ML models operate through a series of layers containing neurons. The first layer, called the input layer, receives the data. Through this data, the machine learning process is initialized. Next, the model contains one or more hidden layers, which is where core learning and pattern extraction occurs. The more hidden layers a ML model has, the “smarter” it becomes, allowing it to better extrapolate relationships in the data given in the input layer. A model with 10 hidden layers would be able to find distinct correlations in the data much better than a model with only one input layer. However, this model will also run slower than a model with 1 hidden layer due to an increase in training time. Finally, the last layer is the output layer, which consists of the model’s prediction on the data initially given in the input layer. \n\nModels usually operate on training and testing data. To provide accurate results, it is essential that the testing portion is wholly different from the training portion. During the training portion, the data enters the input layer and passes through the hidden layer. In the output layer, models incorporate a loss function. In this step, the loss function measures the model’s predictions against the actual value in supervised learning, while in unsupervised learning, the loss function measures how well the model was able to extrapolate relationships and correlations in the data. Based on these results, the model updates the hidden layer accordingly in order to improve its results on the next portion of the training dataset. \n\nThe testing portion includes data being passed through the input layer and analyzed by the hidden layer. This step is crucial as the training of the hidden layer functions indicate how well the model is able to detect relationships and make predictions on the data. Finally, a prediction is passed through the output layer. \n\nML models are not always 100% accurate - in fact they often are never 100% accurate. To achieve this accuracy, models must be completely right, which means that their hidden layer must be perfect. This is not always the case. To improve accuracy, one must have lots of data in order for the functions in the hidden layer to adjust themselves in the training phase, along with lots of hidden layers as well. By including these features, one can easily improve the accuracy of a ML model. \n\nMachine learning is no longer a futuristic concept - it’s currently being utilized by companies, organizations and researchers across the globe and has already positioned itself in the midst of our everyday lives. Amazon is able to push products towards us through these models, using our previous purchase history as the data. Most importantly, they are able to do this without any human intervention, highlighting the goal of building systems that can adapt and improve on their own. Even without labeled data, ML models are still able to detect anomalies and relationships in data. However, although ML may sound powerful, it is critical to understand its limitations and drawbacks as well. The utilization of machine learning wisely and efficiently is the future of our community. "
    },
    {
        "id": 3,
        "title": "Chemical Reactions: The Basis of Change",
        "excerpt": "Chemical reactions occur no matter where we are in the universe, and serve as the foundation for almost every single process on our planet.",
        "category": "Chemistry",
        "author": "Ayush Srivastava",
        "readTime": "6 min",
        "thumbnail": "https://images.scienceglimpse.org/image3.jpg",
        "date": "2025-08-09",
        "content": "Chemical reactions are all around us. They’ve been occurring long before humans were created, long before even the earth existed. Ever seen iron rusting? That’s a chemical reaction. Tried mixing vinegar and baking soda together and seeing fizzing and bubbling? That’s also a chemical reaction. These reactions have been occurring for eternity and us humans have extracted various laws and principles governing these reactions. \n\nHave you ever seen a chemical reaction? Like H2(g) + I2(s) → 2HI(g)? If not, this is the notation for the reaction between hydrogen and iodine that creates hydrogen iodide. Essentially, a chemical reaction is the process of one or more substances chemically changing into another substance. Water freezing wouldn’t be a chemical change since the atoms making up the ice are still H2O - they’re just in a different form. However, iron rusting would be considered a chemical change as the chemical composition (which refers to which atoms are present) is different once the reaction is complete. In a chemical reaction, the substances on the left are called reactants, while the substances formed on the right are called products. \n\nNow, metals, since they have electrons to lose, tend to react with nonmetals, since nonmetals tend to gain electrons. This reaction usually forms an ionic bond between the two elements. An ionic bond is formed from the transferring of electrons. An example of an ionic bond would be NaCl(s). Sodium has 1 extra electron it would like to give away, while chlorine has 1 electron it would like to gain. As a result, these two elements form an ionic bond with each other. Ionic bonds tend to be extremely strong and brittle. They are almost always made of metals and nonmentals. \n\nHowever, elements and substances can often share electrons amongst themselves as well in order to maintain balance in their electron structure. These types of bonds are called covalent bonds and usually form between nonmetals. An example would be carbon dioxide, or CO2. Carbon and oxygen share their electrons in order to maintain stability. Covalent bonds are typically weaker than ionic bonds but are still strong nonetheless. \n\nAs the strength of the atomic bonds increases, substances tend to exist in solid or liquid states at room temperature because stronger bonds hold particles closely together. Conversely, weaker bonds or interactions result in substances that are more likely to be gases, as the particles do not stick together strongly and can move freely. \n\nNow, however, what you’ve been assuming now is that the substances making up the reactants of the reaction will always react when close together - but this is not the case for a myriad of reactions. Often, favorable reactions may display this phenomenon, but on the other hand, some reactions may need energy in order to complete. This classifies a reaction as either endothermic or exothermic. \n\nEndothermic reactions tend to require energy in order to start the reaction. The additional energy will cause the particles to collide with each other more frequently and, as a result, participate in the reaction. Endothermic reactions tend to be unfavorable. Energy may be released at the end of the reaction but that energy never crosses the initial amount of energy needed to be put in. \n\nThe exact opposite of an endothermic reaction is an exothermic reaction, which tend to release large amount of energy after the reaction has gone to completion. These reactions tend to be hugely favorable since more energy is released when the reaction is complete. However, this doesn’t mean that no energy is required to get the reaction running - it just means that the energy released from the reaction is larger than the amount of energy put into the reaction. \n\nIn short, just by physically mixing two things together does not mean a reaction occurs. But how do we know how much energy to put in? Well, chemists have a name for this one as well. Its name is called the activation energy. The activation energy details how much energy to put in to get a reaction going. This value is different for each and every reaction as each reaction is different. A reaction can only go to completion once the activation energy is met-  or else it will not run. \n\nNow, on the other side of the reaction, where the products form, you may also be thinking that once a reaction occurs, only products will be left over. But, since science can sometimes be tricky, this is not always the case either in some reactions. \n\nWhen reactions start, they have a rate of formation of products. It could be that they’re forming products at a rate of 5 milligrams per second, or 500 grams per minute. This rate of reaction determines how long it takes for a reaction to complete. Some reactions require less than a second, while others (including decay) may require years, and possibly even thousands and millions of years as well. An example would be the decay of xenon, which takes half a trillion times longer to complete than the age of the universe. \n\nAlso, many reactions don’t simply go one way. As products form, sometimes they react back to create the original reactants. This continues until the reaction reaches a balance called chemical equilibrium, where reactants and products coexist in stable amounts. This means that the reactants and products actually coexist together. But how do people actually determine how much is present at equilibrium? \n\nWell, they use K, the equilibrium constant. The value of K is different for every reaction and details the extent to which a reaction will proceed by indicating the ratio of products and reactants at equilibrium. Some reactants, when mixed together, go to completion and only the products are left. These reactions, however, do not go to completion, and when equilibrium is established, there are still both reactants and products remaining. A higher value of K indicates a high level of completion, as there are more products than reactants. A low value of K indicates that the concentration of the reactants is higher than the concentration of products. A value of 1 for K signifies that the concentration of products and reactants at equilibrium is equal. \n\nAn example of a reaction involving equilibrium is the formation of nitrogen monoxide, from O2(g)+N2(g)⇌ 2NO(g). The double arrow indicates an equilibrium reaction. For this reaction, oxygen, nitrogen, and nitrogen monoxide are present at equilibrium. \n\nChemical reactions are far more than just things mixing in a beaker — they are dynamic processes that shape everything from the air we breathe to the fuel that powers our lives. Whether fast or slow, simple or complex, reactions follow clear principles: they occur at specific rates, often reach equilibrium, and are governed by the conservation of mass and energy. \n\nUnderstanding how and why reactions happen gives us the power to design better medicines, cleaner energy sources, and smarter technologies. In the end, to study chemistry is to understand the invisible forces constantly at work in the universe, subsequently transforming matter, releasing energy, and sustaining life itself."
    },
    {
        "id": 4,
        "title": "The Phantom Planet",
        "excerpt": "Dives into the mystery of the unseen, yet irrefutable, objects that have been observed in the past, such as Neptune and Pluto, and how, using this same process, the possibility of a ninth planet beyond Pluto residing within the Kuiper belt.",
        "category": "Astronomy",
        "author": "Ansh Sharma",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image4.webp",
        "date": "2025-08-14",
        "content": "Back when I was seven years old, I was fully convinced that a ghost was haunting my house. No, I never saw this ghost, but I knew it existed. Whether it was the whispering creak of the floor, ominous shadows that pranced inside my room, or even the soft thumping knocks on my door, the ghost was keeping me on my toes. The fact that I hadn’t seen this ghost yet terrified me, and infuriated my mom till the end. Her reasoning was always, “If you can’t see it, then how do you even know it’s there?” Back then, this argument usually sent me back upstairs, attempting, in vain, to fall back asleep. \n\nBut now, if my mom were to ask me this question (hypothetically, of course, because obviously I’m still not frightened by Hollowface, definitely not), I would most likely rebut by explaining that, if scientists had followed her logic, then we would still only have seven planets in our solar system— not eight. \n\nNeptune wasn’t discovered by coincidence— in fact, it wasn’t even initially discovered through direct observation using a telescope. The first-time scientists predicted Neptune’s existence in the 1800s was through rigorous math, an incredible breakthrough in the way we thought about the universe, but not extremely complicated when broken down. \n\nWhen a planet orbits the Sun, scientists can predict its exact orbital path using its mass, distance from the Sun, and proximity to other large objects (other objects’ gravitational force would pull the planet towards them, barely, slightly altering the orbital path). When scientists observed the orbit of Uranus, the seventh planet from the sun, they discovered a slight variation in the orbital path from what was predicted on paper. \n\nThe only plausible explanation for this would be the existence of another planet— about 17 times the mass of the Earth— that was pulling Uranus towards it, therefore altering its path around the Sun from what was theorized. \n\nThrough Newton’s laws and careful math, even though scientists couldn’t see this new planet, they knew it must exist. In 1846, the genius French mathematician, Urbain Le Verrier, calculated the approximate mass, position, and orbital path of this ghost planet. His predictions were so precise that he was able to give the astronomers at the Berlin observatory exact coordinates to the planet’s location in the sky. That night, when they swiveled their telescopes to his calculated point, they discovered that his coordinates were only off by a minuscule 1 degree, leading to the discovery of the eighth planet— Neptune, the ice giant. \n\nThis discovery gave us more than just a new planet to add to the poster site. It was the first time a celestial object had been found without direct observation— and proved that even unseen forces, like gravity, could be predicted by the vision of mathematics. \n\nAfter this revelation, scientists in the early 1900s also discovered deviations in the orbit of Neptune. Now that the scientists had a well-thought-out process, they were able to calculate the position of the ninth planet quickly. In 1930, a young astronomer named Clyde Tombaugh compared photographs of the night sky and discovered a faint, moving object— Pluto. \n\nThe funny part about this entire episode is that it was completely incorrect. It turns out that since Pluto is only 0.2% of the mass of Earth, its gravity wouldn’t have been able to be observed in or even affect Neptune’s orbit at all! The reason scientists believed that there was a deviation from its predicted path was due to observational errors coming from the satellite Voyager 2, not due to a huge planet that would tug on its orbit. That’s why the position of Pluto in Clyde’s photos didn’t match the predicted position— because Pluto’s gravitational field was too small to affect Neptune at all. In the end, Pluto’s discovery was due to a happy coincidence. \n\nAfter Pluto’s unfortunate ejection from planet status (now known as a dwarf planet), for years it has been accepted that there are only eight planets in the solar system— Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune…that is, up until now. \n\nRecently, scientists have noticed that objects in the Kuiper belt (KBO for short), an asteroid belt beyond the orbit of Neptune containing many icy bodies and dwarf planets (like Pluto), have been behaving strangely. Not only are their orbits offset from what is predicted, but they seem to be shepherding around a large object— even larger than Neptune. \n\nDue to this object’s distance from Neptune, it does not affect Neptune’s orbit despite its large size. In models and trails, a Ninth Phantom Planet would perfectly explain the irregularities in the orbits of the objects in the KBO. Other predictions, such as observational errors— like what happened with Pluto, a passing star affecting their orbit, or a large clustering of smaller objects that is creating a large gravitational field have been predicted, but so far, the most plausible explanation revolves around two leading theories. \n\nOne theory suggests the existence of a ninth planet that we haven’t been able to observe yet. The reason for this may revolve around its distance from Earth, which would make it appear incredibly dim; it may lie within a dense star field, making it hard to distinguish from other objects; or current telescopes may lack the required sensitivity or field of vision to spot such a slow-moving object. Despite these speculations, scientists still have no clear idea of why we haven’t been able to observe it yet. \n\nThe second theory is significantly more spine-tingling— the possibility of a black hole lurking within the Kuiper belt. This hypothetical black hole would only be the size of an apple, but still have an incredible gravitational pull— comparable to a huge planet. Luckily, this black hole wouldn’t cause much trouble for us due to its relatively miniscule size and distance from Earth, but it could throw the KMO in a state of disorder, causing some to bodies to be thrown off orbit and go careening into deep space; increase collisions inside the KBO; and potentially, if leading theories about black holes expanding through matter consumption are true, start growing large enough to affect Neptune. Once again, it’s extremely fortunate for us that even if this were true, it would take billions upon billions of years to accomplish, since the small size of KBO objects would prove too tiny for it to make any notable growth. \n\nAstronomers like Dr. Konstantin Batygin and Dr. Mike Brown— who first proposed Planet Nine— are collaborating with international teams using advanced observatories such as the Subaru Telescope atop Mauna Kea, the Vera C. Rubin Observatory in Chile, and the Atacama Large Millimeter/Submillimeter Array (ALMA). They’re running massive computer simulations and carefully tracking orbits of distant Kuiper belt objects to narrow down where this mystery planet could be located. Every small shift in an asteroid’s orbit, every tiny gravitational oddity, every subtle distortion of an object, leads us one step closer to unveiling this enigma. \n\nThe discovery of this new object would serve as more than just another planet to add to solar system charts, but would force us to dig more deeply into the story of our universe. We’d gain clues on how outer planets are formed, why the Kuiper belt is shaped the way it is, and whether our solar system has had encounters with other stars in the past. It could even be the missing page that allows us to open a new chapter in our book of cosmic history. \n\nGoing back to my childhood delusions, even though I couldn’t see this ghost, in my head, all signs pointed to the fact that it was alive. Every creak, knock, and shadow just seemed like further evidence to solidify the fact that I was being haunted. Even though my mother’s question, “If you can’t see it, how do you know it’s there?” seemed so irrefutable at the time. But this same question has driven generations of scientists to look past the visible and into the unknown. \n\nIf we can detect a planet without seeing it, if using mathematics, we can map the pull of something beyond what we can observe…then what else could be out there? \n\nWhispering through the vacuum of space. \n\nDropping clues on its subtle existence. \n\nInvisible yet undeniable. \n\nWaiting."
    },
    {
        "id": 5,
        "title": "From Hail to Algorithm: The Rise of Autonomous Taxis",
        "excerpt": "No taxi driver? No problem. The future of driverless taxis is on its way to your doorstep. So before they arrive, let’s explore what they have to offer.",
        "category": ["Engineering", "Technology"],
        "author": "Aarav Madan",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image5.jpg",
        "date": "2025-08-10",
        "content": "When’s the last time you hopped into a taxi? Or how about an Uber or Lyft? No matter what type of ride-hailing service you use, there's always that awkward silence as the driver cruises down the highway for 20 minutes. Sometimes you’ll even get a Moody Margret who honks every minute and swerves like she’s in Fast & Furious. \n\nProblems can arise anytime a human driver takes the wheel — so what happens if we make that driver a robot? \n\nCompanies, including Tesla and Waymo, are already invested in the technology. As of today, a small number of commercially available fully driverless taxis are ready for consumers in the US. 2 brands are merging ahead of the driverless taxi scene. Tesla Inc. is currently in the testing stage of its new autonomous taxi, the Robotaxi. Meanwhile, Waymo, an American autonomous driving technology company, is starting to operate with its ride-hailing service named Waymo One. \n\nHow do Driverless Cars Work? \n\nThink of a highly trained guide dog navigating a blindfolded person through a crowded city. In other words, that’s the job of an autonomous vehicle. Just as a guide dog can use its senses to navigate an area, AI systems within the vehicle utilize different types of methods. \n\nLidar Sensors: In order to measure distances and create detailed 3D representations of their environment, lidar sensors project a laser light onto objects. \n\nUltrasonic Sensors: These sensors are primarily used for parking the self-driving taxi. Think of how a bat uses echolocation. Bats shout, the sound bounces off a wall, and bats know how far the wall is by how fast the echo comes back. Ultrasonic sensors work the same way. They can calculate distance by using sound waves of frequencies above what humans can hear. \n\nRadar Sensors: Using radio waves to measure distance, speed, and sometimes direction of the vehicle. \n\nCameras function as the “eyes” of the autonomous vehicle. They can be used in a variety of scenarios, such as navigating pathways, interpreting traffic signals, monitoring the driver, and much more. \n\nThere are more specifics involved, but at the basis of it, driverless cars are built on these core sensors and code. \n\nSafety for Passengers \n\nAlthough companies are persistently refining this hardware and software, there is still much more room for improvement, especially when it comes to the safety of the passengers. Self-driving cars, on average, have more than twice as many accidents as human-driven cars. While regular vehicles have 4.1 crashes per million miles, self-driving cars have 9.1 crashes per million miles driven. \n\nThese vehicles are constantly operating off their training data. So when the world doesn’t match their training data, they struggle to perform even the most basic operations. A case in 2022 perfectly displayed this matter, as a self-driving car stopped while making a left turn and was hit by an oncoming car. Later in 2023, a self-driving car failed to recognize the other part of an articulated bus and ran into it. \n\nBy lowering overall fatalities and improving self-driving systems, passengers can feel safe at all times. \n\nWhen Will the First Commercial Driverless Taxi Reach Me At My Doorstep? \n\nWaymo, an American autonomous driving technology company, plans to roll out its autonomous ride-hailing service in Dallas by 2026. In Waymo’s testing phase, they are currently providing more than 250,000 paid trips every week with about 1,500 vehicles in populated cities such as San Francisco, Phoenix, Austin, and Los Angeles. \n\nIn terms of Tesla’s take on driverless taxis, it’s still unclear when the official launch of the Robotaxi will be. However, as of now, Tesla has carried out numerous tests for the taxi, including a group of Robotaxis providing rides to paying passengers in Austin on June 22, 2025. Austin’s roads have become the stage for an epic driverless duel. Grab your popcorn: it’s Tesla vs. Waymo, and the race is just getting started: Who you choosin’? \n\nHow Much Does a Ride Cost? \n\nFinally, when it comes to cost, prices can vary for different autonomous taxi companies. For instance, a Waymo ride generally costs more than those of Uber and Lyft; Waymo rides cost an average of $20.43, which is about $5.99 more than an average Lyft ride and $4.85 more than an average Uber ride. Meanwhile, Tesla plans to go easier on people's wallets. As of now, Tesla's robotaxi service in Austin is offered at a flat rate of $4.20 per ride. \n\nEnvironmental Effect \n\nDo driverless taxis hurt or help the environment? A recent study suggests that half of new autonomous vehicles could be autonomous by 2050, and half of the entire vehicle fleet by the 2060s. Due to the fact that there is such a great push to go all-electric, these vehicles will be essential in creating a zero-emission future. Compared to conventional vehicles operating on fossil fuel, Self-driving cars generate very little emissions over their lifetime. \n\nThe future of transportation is just around the corner (No, literally, there may be a Robotaxi around your block, especially if you live in Austin), so it’s important to be ready. Hopefully, the next time you travel to work, you can sit back, relax, and enjoy your human-free taxi."
    },
    {
        "id": 6,
        "title": "CRISPR: The Forefront of Genetic Editing",
        "excerpt": "CRISPR is like nature’s ultimate DNA toolkit, letting scientists edit genes with amazing precision — but also raises big questions about how far we should go.",
        "category": "Medicine",
        "author": "Kavin Puri",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image6.jpg",
        "date": "2025-08-14",
        "content": "Part 1: An International Rivalry \n\nEvery single day, a war is going on, resulting in trillions of casualties at the hands of highly specialized weapons. No, this isn’t some science fiction story— it’s real and it is happening all around you! However, both the attackers and the victims may not be what you think they are. \n\nBacteriophages are specialized types of viruses that only attack bacteria— and there are a lot of them. It’s been hypothesized that there are more bacteriophages than all other organisms combined. Whenever these specialized viruses attack bacteria, they insert their genetic code— single-stranded or double-stranded DNA/RNA— inside the bacteria, which essentially “hacks” the bacteria to make more copies of the virus. Once enough have been made, the bacteria are basically told to explode, a process called lysis, where the bacterial cell uncontrollably splatters apart, releasing hundreds to thousands of new phages, each ready to affect their next victim. But it turns out that a few bacteria have a special trick up their sleeve. \n\nNow, most of the bacteria infected by a bacteriophage are doomed from the start— but some get lucky. Maybe the virus couldn’t insert its genetic code properly, or the bacterium was able to defend itself. Either way, the bacteria now have a piece of viral genetic code that hasn’t been properly implemented into its DNA— think of it as a piece of malware that hasn’t been downloaded onto the bacterial laptop yet. So, what does the bacteria do? \n\nWell, it goes ahead and downloads the malware anyway! \n\nNow, at first, that sounds completely counterintuitive. But here comes the special weapon that the bacterium has. Unlike a virus, which puts its DNA/RNA wherever it wants, the bacterium instead inserts it into a specific location in its genome called a CRISPR region. This region exclusively serves the purpose of housing viral code from a bacteriophage that the bacteria have since survived an attack from. This code won’t be activated to make more viruses, but instead serves a much more important function for the bacteria’s long-term survival. \n\nNow, this process is similar to how vaccines work, which trains the immune system to respond to a pathogen much faster and with greater accuracy a second time than when it first attacks the body (stay tuned for a vaccine-related article soon!) Similar to this, bacteria will store the viral code, ready for when that same species attacks it again. When this happens, the bacterium uses these stored sequences to produce matching RNA molecules, which guide specialized proteins called Cas (CRISPR-associated) proteins to the viral DNA. The Cas proteins then cut the viral DNA apart, neutralizing the threat. \n\nPart 2: When Pigs Glow \n\nCRISPR stands for “Clustered Regularly Interspaced Short Palindromic Repeats.” Marked by short sequences of DNA that repeat over long intervals, it is present in virtually every species of bacteria. But what exactly does that have to do with us? Since the first evidence for CRISPR in 1987 of E. coli bacteria was observed, researchers have published hundreds of articles about how this genetic tool not only enables bacteria to fend off viral threats, but also to accurately and efficiently edit their genetic code. And somewhere along the line, we started thinking, “What if we were able to do that?” \n\nSince the discovery of CRISPR, we have made increased progress in understanding how the process works, and mainly just observing it in bacteria. However, in 2013, CRISPR was revolutionized when the first demonstration of modifying mice and even human cells was made. Suddenly, the possibilities became endless. For the next decade or so, we have been able to engineer science fantasies from labs across the country. Inserting fluorescence genes into pigs to make them glow and engineering larger fish for better yields, however, are just the tip of the iceberg! \n\nFor example, those same pigs that were once a cooler version of a night-light are now being engineered to potentially grow human-compatible organs for transplants and save lives as a result. Cows and other livestock have started to be engineered to be resistant to many of the most common diseases that afflict them, potentially reducing the costs of animal pandemics on the global supply chain by billions of dollars in the future. And mosquitoes resistant to plasmodium— the protist that carries the deadliest pathogen-carried disease in the world, malaria— are being engineered to potentially create colonies of mosquitoes that cannot carry the disease, reducing malaria rates drastically worldwide. \n\nIt’s important to note that all of these examples are in their early experimental stages, and most aren’t released wild or available in the commercial supply chain. But they are real, and they exist thanks to CRISPR. But then that begs a much more important question: if we can so easily change the genes of whatever organism we want…then why not ourselves? \n\nPart 3: Let’s go Build-a-Baby! \n\nReactions ranging from awe to nervousness to outrage sparked when, in 2018, Chinese scientist He Jiankui announced the birth of twin girls whose genomes were edited with CRISPR. Up until that point, labs hadn’t even thought of genetic editing human subjects for a long time— remember that just editing a few random human cells had happened only 5 years ago. Violating a plethora of medical standards and health codes in the process, Jiankui was subsequently jailed and fined, alongside 2 associates. \n\nEthics committees condemned his actions— after all, note that to edit them, Jiankui had to take two very major risks. The first is that genetic editing can only be done to any organism at the stage of the embryo, where the “person” is just a small cluster of rapidly splitting cells, and even the slightest mishandling of the embryo could render it unviable. The second issue is that modifying a person’s entire genome at the germline level means that any errors that happen in their DNA would then be passed down to future generations. However, his actions did have some reason to them, as thanks to his intervention, both girls would be born immune to any HIV infection— an amazing result, but at what cost? \n\nOf course, we have been able to make experimental genetic therapies for human adults, targeting specific organs and disorders. In 2023, the first full regulatory approval was granted in the U.K. and U.S. for a CRISPR therapy to treat sickle cell disease, among other conditions. This is clear proof that treating genetic conditions using CRISPR could prove to be a valuable tool in saving lives. There are several implications of using CRISPR to implement genetic modifications for anything that has DNA-based ties, from cancer to alzheimers. But in the case of He Jiankui, he took it several steps ahead, changing an entire organism before they were even born. \n\nThis has led to concerns that in a few years, we will get the ability to make “designer babies”, kids that have specific genetic modifications that are made willy-nilly. Perhaps parents could get the ability to modify how their kids look, act, and think before they are even born, thanks to CRISPR. We could see things like a Build-A-Bear for kids— people picking and choosing the best parts to go into a kid, designing them to be a perfect 6-foot-tall, blond, athletic, intelligent student. But is it ethically right to use such a powerful tool on such superficial things that don’t matter much in the grand scheme of things? And is it morally okay to do all of this without the consent of the people they are modifying, fundamentally changing their lives forever? \n\nThere are so many things that we could still talk about, but it should be clear that CRISPR has the potential to save many lives in the future. Whether to develop organisms and important animals with genes for disease resistance to increase nutritional value, or to the development of cures for widespread genetic disorders, CRISPR has great potential to be used for good. It's up to us to not only use it to help as many people as possible, but also to regulate it in moderation, taking great care that we don’t abuse our power over this great tool of the future."
    },
    {
        "id": 7,
        "title": "A Universe-Sized Crunch Bar",
        "excerpt": "Discover the ways that the universe could end and how it began - with a delicious candy bar.",
        "category": ["Junior", "Physics"],
        "author": "Medhansh Garadala",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image7.png",
        "date": "2025-08-11",
        "content": "It’s Halloween right now, and you just went trick-or-treating. You’re sweaty, tired, and hauling a big, fat load of candy—so close to just dropping it down and eating it all. And you do just that. Sitting down on a patch of grass, you dig into your pillowcase to find a big blue, king-size Crunch bar. Oh boy. It looks delicious. So, like any chocolate-loving kid, you tear apart the wrapper and bite into the bar. At first it’s good. Real good. It’s crispy, popping all over your mouth and silky smooth. But after a few seconds, it collapses into just crumbs and sugar. It’s gone. That’s what some scientists think will happen to the universe. A Big Crunch. \n\nBut to understand the end, we have to understand the beginning. The beginning for our universe lies within the Big Bang, or the first bite of the bar. Every single thing, time, space, matter, was all compressed into a singularity. “An infinitely dense, infinitely hot point.” Then something triggered. In a fraction of a second, existence itself was born, and the universe expanded faster than the speed of light, unstoppable and vast. \n\nAs the expansion cooled down, the universe worked its magic into creating particles, atoms, planets, stars, galaxies and a special something that breathes within us: life. The flash from beyond 13.8 billion years still echoes today in the Cosmic Microwave Background, a dim glow that remains from a baby universe. Gravity sculpted for eons, forming galaxies like ours, but the story doesn’t stop there. Something interesting was happening as reality was organizing itself. \n\nThe universe wasn’t only expanding, but accelerating. Why? It was because of the invisible push, also known as dark energy. Making up approximately 68% of the universe, it acts as a force that divides. Galaxies race away from each other while the universe stretches away like pizza dough every second. \n\nSo now comes the end. There could be either a crunch, a frozen treat, or a ripped piece of licorice waiting for us at the end of existence. A common theory is the Big Freeze, also known as the heat death of the universe. What if the universe continues to expand forever? Billions and trillions of years of expansion. Every star runs out of fuel, galaxies drift apart too far for interaction, and all that’s left is an empty, cold infinitely expanding space. \n\nAnother would be the Big Crunch, where dark energy weakens and gravity becomes the king, gaining control and pulling everything inward. Collisions, sparks, and heat. Space-time collapses on itself. Everything clusters back into the original point. A dramatic finish for the Universe. \n\nThe last and most violent death would be a Big Rip, where instead of gravity being king, its dark energy. And as it becomes stronger and stronger, it tears apart galaxy clusters, solar systems, planets, atoms, and space-time itself. The tear doesn’t stop until the universe is in shreds. \n\nSo what does this do with a Crunch bar? It’s a simple metaphor for saying how we live inside a cosmic candy, caught between the snap of its beginning and the crumble of its end."
    },
    {
        "id": 8,
        "title": "The Atlantic Puffin",
        "excerpt": "The Atlantic Puffin is a tiny, colorful bird with a big personality! Discover where they live, what they eat, and how people are helping them survive.",
        "category": ["Creature Profile", "Biology"],
        "author": "Kavin Puri",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image8.png",
        "date": "2025-08-03",
        "content": "Is that a Penguin?! \n\nNo, but it kinda looks like a Parrot… \n\nThese are the Atlantic Puffins! A relatively small, yet hardy bird, these guys are often called “The Clowns of the Sea” — and for good reason! We will do a deep dive on everything there is to know about the Puffin — from where it lives, to what it eats, and so much more! \n\nWhere can I find them? \n\nPuffins are found throughout the icy regions of the northern hemisphere. If you are out looking for puffins, the best time to do so is during their breeding season, Late April to August. This is when large flocks of puffins come ashore to breed and nest, and you are best off traveling throughout isolated, rocky islands near shore or steep rock cliffs to find them. However, for the rest of the year, they are usually far out at sea and beyond human reach, spending this part of their lives throughout the oceans by themselves. \n\nIf you’re like me and live in the US, your best chances of seeing puffins are traveling up to Maine, where puffins will often nest across the shoreline, or on islands close by. However, they are more common as you travel further north, with large colonies ranging from hundreds to thousands of birds present in colonies that are scattered throughout Canada, Greenland, Scandinavia, Scotland, and especially Iceland, which reportedly has over half of the world’s Atlantic Puffins! \n\nWhat do they look like? \n\nAs we’ve joked around, puffins are kind of similar to how a penguin crossed with a parrot might look — but rest assured, these guys are unique from any other bird species! They carry black feathers that cover their back and arms, and white ones everywhere across the underside of the puffin’s body, which shield it from the harsh cold environment. Alongside the feathers, puffins sport colorful feet and beaks, striped with shades of grey, yellow, and bright orange. In terms of size, Atlantic Puffins are one of the smaller seafaring birds, typically around 11-12 inches long, 8 inches high, and a wingspan of anywhere from 19 to 25 inches (that’s longer than the puffin itself!). But hey, even if Atlantic Puffins may be a bit on the small side, I’m sure they still have a great personality that more than compensates. And guess what — they absolutely do! \n\nHow do they behave and act? \n\nAs previously mentioned, Atlantic Puffins spend a good chunk of their life entirely at sea. The average puffin will spend 2/3 of its entire 20-year lifetime at sea, usually living a solitary lifestyle by itself. Puffins will do everything from eat, sleep, and take care of themselves on the ocean. Throughout a typical day, a puffin will spend a good amount of its time preening itself, which is just a fancy way to say it keeps its plumage controlled and spreads oil throughout it that comes from its preen glands. This oil is what allows the puffin to remain semi-waterproof, enabling it to easily & smoothly propel itself through the water as it swims. Actually, instead of “swimming” like a fish might, puffins often use the waves to propel themselves, enabling them to surf to their next meal! \n\nHowever, the story is entirely different during the breeding season. As spring begins, mature puffins (typically at least 4-5 years old) return to land — usually back to the colony where they were raised as young chicks — much like salmon that travel to their nesting site when they breed. Puffin “nests” aren’t like your typical bird nest; instead, these areas are closer to holes that are made by digging up a chunk of land and vegetation, in which the eggs are laid. Both genders have specific tasks in taking care of the eggs and chicks: males spend more time guarding and taking care of the nest, while the female spends more time incubating the eggs and feeding the chicks. \n\nWhat do they eat? \n\nSpeaking of meals, a puffin's diet is almost entirely composed of small fish, ranging from herring, sandeels, hake, and capelin. However, a puffin may occasionally eat small crustaceans and other invertebrates if food is scarce in an area. Puffins typically hunt for food by flying very close to the ocean surface, sometimes at speeds of up to 50 mph. When it finds food, it lands in a pretty interesting way — since there is no land for it to latch onto and properly land on, most puffins will simply belly flop as they land on the ocean! Once they have caught and eaten enough, they will usually take off by flapping their wings rapidly as they skim the water’s surface, gaining momentum until they can fly again and find another place to repeat the cycle all over again. \n\nPredators & Conservation \n\nThanks to their small size and being isolated on small, barren islands or scattered throughout the ocean, puffins don’t have many predators. Being separate from the main masses allows them to remain safe from creatures such as dogs, cats, weasels, and foxes. At the ocean, predators come in from above or below. Larger birds such as the Great Suka can often attack puffins mid-flight, while seals and even some sharks have been able to eat puffins underwater. \n\nDespite these natural threats, the biggest threat to puffins is, well, us. In 2015, the Atlantic Puffin’s conservation status was recently changed from Least Concern to Vulnerable, a sign of declining puffin populations throughout the world. Ocean pollution, such as oil spills, has led to great losses of puffin habitat throughout much of Scandinavia, while climate change has caused puffins to become restricted to places that are still cold enough for their lifestyle, as glaciers and ice caps continue to melt. With all of these factors, current trends estimate that the European population of puffins will decline by 50–79% between 2000 and 2065. \n\nFortunately, there have been significant efforts to revive Puffin populations worldwide - and many of them are seeing great progress! Hunting puffins used to be a popular pastime & way to get food throughout the 20th century and earlier, but many countries, such as Iceland, have now outlawed the practice. Additionally, organizations such as SOS Puffin have been created to revitalize puffin populations among islands that used to have breeding colonies but currently do not. Other efforts include cleaning up pollution and other waste throughout oceans and puffin breeding grounds, and efforts to reintroduce Puffins to other areas across the world. \n\nIn the end, Atlantic Puffins are more than just “clowns of the sea” — they’re tough, colorful little survivors braving icy waters and rocky cliffs. Let’s hope our efforts help keep these charming birds around for generations to come!"
    },
    {
        "id": 9,
        "title": "The Best Studying Strategy",
        "excerpt": "Active recall is an art that allows our brains to retrieve information in record time, allowing people to use this process in every career.",
        "category": "Psychology",
        "author": "Ayush Srivastava",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image9.webp",
        "date": "2025-08-23",
        "content": "Have you ever just blanked during a test? If you haven’t, you're in luck, but I wasn’t as fortunate. I still remember sitting in my BC Calculus test, sweat dripping down my forehead as I stared at the questions. No matter how hard I tried, the math just wasn’t coming to me. I had spent hours rereading my notes and practicing problems, desperate to understand formulas and concepts, but when it mattered most, nothing seemed to stick. Now, before any big math test, that memory haunts me. I don’t ever want to relive the same nervousness and fear again— and so I found a better way to actually retain what I’m studying.\n\nActive recall is a concept that scientists and researchers have been studying extensively for a very long time. Studying using flashcards, summaries, and rereading notes only puts the information into your head. However, what many students forget is that test-taking involves a combination of two processes: retaining information and retrieving information. The methods that most people follow only involve the first process of retaining information.\n\nSo, what do you need to do on the day of the exam? Certainly not the first process!\n\nDuring a test, you need the second process, the process of retrieving information. And that is the essence of active recall.\n\nActive recall is the art of recollecting information from your brain. By practicing this process, information can be retained more easily in your head. Thinking about this process through neuroscience and other brain-related fields, retaining information fosters the development of neural connections in the brain, but these connections are weak. Over time, these connections will break, and one starts to forget information they learned previously. However, research has shown that active recall not only maintains that connection for a longer period of time, but also strengthens that connection as well. Practicing active recall allows a student to retain information more easily, since their neural connections are much stronger.\n\nWhen you actively recall something, your brain is not just pulling a memory off a mental shelf. Instead, it’s rebuilding it from the ground up. Each time you do this, the neurons involved fire together, strengthening the pathway between them through a process called long-term potentiation. This means the next time you need that piece of information, the signal travels faster and more efficiently. Without recall, these connections slowly weaken. This is a phenomenon first mapped out by Hermann Ebbinghaus in the late 19th century as the forgetting curve. Active recall essentially acts as a workout for your brain, keeping those connections strong and resistant to fading, while long-term potentiation represents the muscle growth that occurs afterward.\n\nNow, active recall doesn’t just help you remember, but also changes how you think. The repeated act of retrieval trains your brain to navigate your mental library more quickly. Over time, this improves not only memory retention but also the speed of recall. This is why experts in any field often seem like they have instant access to knowledge. It’s just because their neural pathways have been reinforced so many times that retrieval feels effortless.\n\nMoreover, active recall sharpens problem-solving skills. When you recall information without prompts, you learn to connect ideas in novel ways, strengthening not just isolated facts but also the relationships between them. This makes it easier to apply knowledge in unfamiliar contexts,  whether that’s diagnosing a patient, composing music on the spot, or improvising in a foreign language.\n\nThis process is useful in almost every field, from musicians having to skillfully play their instruments, to doctors recalling symptoms, and even language learners and linguists recalling words. Everyone naturally does active recall, but by amplifying the usage of active recall, one can retain much more information than another person who passively uses active recall for everyday tasks.\n\nActive recall is not just a technique for students or professionals, but a fundamental process our brains use every day to navigate the world. When you try to remember someone's birthday, recall directions to a place you haven’t visited often, or attempt to cook a recipe you haven’t cooked in months, you are using active recall. The more often you engage in this process intentionally, the stronger and more accessible these memories become.\n\nIn a fast-paced world full of information overload, the ability to retrieve important details quickly and accurately is essential. Active recall trains your brain to be that superpower. It helps you cut through distractions and surface the knowledge that matters most, exactly when you need it.\n\nSo whether you’re mastering a craft, learning a new language, or simply wanting to stay sharp as you age, embracing active recall can make a meaningful difference. It turns memory from a passive storage room into an active, dynamic library that is ready to provide answers, inspire creativity, and solve problems on demand.\n\nUltimately, active recall reminds us that memory isn’t static. It’s alive, shaped and reshaped by how often and how deeply we engage with what we want to remember. By making recall a conscious habit, you can unlock the full potential of your brain and keep your mind agile for a lifetime.\n\nSo the next time you are taking a monster of a test, feel at ease knowing that you have, hopefully, practiced active recall (It will drastically improve your score, like my D to an A in BC)."
    },
    {
        "id": 10,
        "title": "A Sliver Away",
        "excerpt": "Bending spoons, moving objects, or genius-level intellect. What could the rest of the so-called “90%” of our brain actually do?",
        "category": ["Debunked", "Psychology"],
        "author": "Ansh Sharma",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image10.jpg",
        "date": "2025-08-27",
        "content": "It’s 10:59 p.m., and the air seems to be coated in silence. You count— 1…2…3…4— each number sending shivers of anticipation down your spine. Every tick of the clock stretches time; your heart races with delight.\n\nEverything is picture-perfect. An array of snacks awaits you on the table, the TV glows mutely, and your blanket wraps around you like a cocoon.\n\n56…57...58…59, and then the clock chimes. You swivel your head to the TV, eyes wide as the “New episodes” button pops up on the screen.\n\nThe new season of Ninjago has finally arrived!\n\nYou reach for the remote, but clench empty air. You look around wildly, heart sinking, until you see it at the edge of the sofa— just a sliver away— every muscle tenses. Your hand outstretched, you imagine bending reality, summoning every ounce of your brain to make it levitate toward you. But it stays there, placid, indifferent, and unmoving.\n\nAnd at that moment, your greatest wish is that you were a psychic.\n\nA common myth is that “humans only utilize about 10% of their brains. So-called “psychics” or individuals with supposed supernatural abilities are often credited with having unlocked the rest of the 90%, allowing them to perform acts usually considered impossible. This idea has inspired books, movies, and even real-life pursuits, with some people dedicating their entire lives to achieving this state through extensive research, performance enhancers, and meditation.\n\nBut reality is far less mystical— and far more mesmerizing. Neuroscientists have already explored this question in incredible detail. The truth is, humans use 100% of their brains even in the simplest of tasks. The act of picking up a cup activates motor regions, sensory pathways, and coordination centers— lighting up far more than a fraction of the brain. And that’s just for something as ordinary as lifting a cup of water.\n\nIn more complex tasks— playing sports, solving math problems, or creating art— brain activity goes into hyperdrive. Multiple regions fire in complex patterns, weaving thought, memory, and motion into a seamless action. Forget leaving 90% of our brains silent; even our everyday lives require the full orchestration of the human brain!\n\nFor those who fall into the 10% myth, the reason is often pop culture, books, and movies fantasizing about surreal power like telekinesis, perfect memory, superhuman intelligence, or even psychic abilities. These unearthly abilities lure people into believing what usually would be considered ridiculous.\n\nThis belief has led some to spend years chasing a nonexistent high. Meditation, drugs, extensive counseling, and so-called performance enhancers are often framed as ways to “unlock” the rest of the human brain capacity. But once again, the truth is very different. Even though practices like meditation and yoga don’t reveal hidden brainpower, they do provide other benefits that can lead to better productivity and mental health, such as stress reduction, improved focus, and better regulation of emotions. Performance enhancers, on the other hand, don’t just magically unlock the rest of your brain. They use the same portion of the brain but temporarily alter the brain’s chemistry— boosting alertness, reducing fatigue, or enhancing reaction time— often at the cost of long-term side effects.\n\nNow, if these facts are there, then why do people still fall into this trap? The lure stems from social media. Often, popular apps such as Instagram, TikTok, and YouTube endorse these wondrous effects. Many of the individuals on these apps either do it for views or are extremely misinformed, often only learning a small portion of the bigger picture that conforms to their beliefs. Psychologically, people believe this due to their deep desire for potential. Humans love the idea that we are just one secret away from greatness, and that the human limit isn’t capped. The myth gives people hope that something magical is waiting— even if science tells a very different story.\n\nUnfortunately, this isn’t the only fantasy people fall for due to this craving. Other examples include:\n\n· Hidden Sixth Sense – Many people believe there exists a dormant extra sense that some people have to a greater extent than others. In reality, it’s just our other senses adapting along with our brains, giving us a false “sixth sense”.\n\n· Unused Muscles – The claim that humans only use a fraction of our muscular strength, and if fully unlocked, some could even lift bulldozers. While it’s partially true that our brain limits our raw strength to protect the body from extra injury, we use far more than the myth suggests.\n\n· Dreams hold secrets – Many inaccurately theorize that dreams are secret messages about the future, when in fact, even though dreams can reflect emotional states and memories, they do not blueprint the future.\n\nAt their core, all these myths hook us the same way: they whisper that this isn’t our limit and that we are more than we appear to be. The right switch, pill, or practice will take us beyond what we are now.\n\nBut these myths go past just fun romanticization of life, and seep into something much more dangerous. Many waste their entire lives chasing the unreachable, spending millions of dollars, and investing in fake products. Online, products like brain enhancement pills (pills claiming to give genius-level focus and brainpower) or Binaural beats apps (boasting audio frequencies that will “unlock” the other 90%) all promise the same, easy way out of work. Claiming that their product is the answer, for astonishing amounts of money, for a simple product that only provides the illusion of increased intellect.\n\nEven worse, some of these products are outright dangerous, and neglect to include these ads or promotions.\n\nIn a huge event where a drug called Piracetam was advertised as one of these so-called “smart drugs,” disastrous consequences followed. Originally, Piracetam was prescribed in small amounts for memory loss, dementia, and learning problems, but in large quantities, this drug can do more harm than good. Side effects such as trouble sleeping, anxiety, depression, or drowsiness plagued buyers of this drug, causing many cases of hospitalization.\n\nAfter further digging, it was found that large amounts of this drug, in unsafe amounts, were illegally being sold without FDA approval. The operation took years to shut down, and even to this day, people continue to fall for these tricks.\n\nThis incident is just one of the hundreds of incidents involving a falsely advertised drug. Taking advantage of human greed, sellers rake in millions off these products, while buyers are left with nothing except ruined lives.\n\nTo avoid these malicious products, follow these steps:\n\n· Check regulations – Only buy FDA-approved products or another trusted medical authority.\n\n· Ask a doctor – Never buy a marketed drug without asking a certified doctor, especially if it’s marketed as a performance enhancer.\n\n· Trust your gut – Remember, if it’s too good to be true, then it most likely isn’t true!\n\n· No cutting corners – Sleep, exercise, a balanced diet, and meditation work just as well, if not better. Don’t take the easy way out with a magical pill!\n\nNow, there you are again, stretching your hand, desperately wishing you could simply make the remote shoot towards your fingers. A bead of sweat slowly forms on your forehead, eyes burning with focus, and you twitch slightly.\n\nTHERE IT WAS! Did it just move a little?! It seems to be shifted a bit towards the right!\n\nDespite your overactive imagination, you sigh, getting out of your warm fortress, trudging to the remote, with a lingering feeling of disappointment.\n\nMaybe psychics weren’t real after all.\n\nBut at least reality had Ninjago on Netflix."
    },    
    {
        "id": 11,
        "title": "Industrial Engineering: The Secret Behind Fast Food Popularity",
        "excerpt": "What makes fast food establishments so successful? You may think it's the food, the speed, or even the convenience, but it's actually the engineering of the franchise.",
        "category": "Engineering",
        "author": "Mihir Harinath",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image11.avif",
        "date": "2025-08-29",
        "content": "Picture this— you walk through a doorway to a Burger King. What do you see? A floor that REALLY needs to be swept; a worker who just wants to go home at the counter; and, of course, that famous Burger King crown that you get after choosing what your delicious meal is. Now, this is just a description of your average Burger King that you can find off practically every American road, and I’ll be the first to say this, it isn’t exactly the most alluring restaurant out there. Yet, every year, Burger King reels in billions of dollars in sales. Why is this? Not because their food is so good that you HAVE to come back (well, that’s subjective), not because their commercials are mindblowing. Not even because their logo is the best franchise logo out there! In fact, the reason why restaurants, like Burger King, continue to bring back customers again and again might actually be because of engineering. Sounds crazy, right?\n\nBut first, let’s set one thing straight… What exactly do we mean by “engineering”? That’s such a broad word, and it really can apply to anything. Biomedical, chemical, mechanical, literally anything else, but what we are talking about today dives into one specific subset that is quite overlooked. Industrial Engineering. Industrial engineering is essentially an entire process of making things easier for humankind. Think of refurbishing an entire house to walk around more comfortably, analyzing data to make a computer program, or even making entire international flight paths take less time. Restaurant franchises use this entire process of Industrial Engineering to make their restaurant more “inviting” to potential consumers. This entire concept of industrial engineering has been used so much by fast food companies that it has really branched out into two main ideas: making their infrastructure more welcoming to potential consumers and heightening the experience that consumers will have when they choose to dine at the restaurant.\n\nFirst Strategy: Architecture\nI don’t know whether you guys have noticed it or not, but I certainly have! In recent years, fast food places like McDonald’s, Burger King, Dairy Queen, Taco Bell, and even Long John Silver's have all scrapped the traditional, whimsical, and almost fairytale-like structures for more corporate, sleek designs for their buildings. Now, at first glance, you may think that this type of architecture leads to fewer people enjoying fast food, and to be honest, I thought that as well. But it has actually worked in their favor! Take McDonald's as an example. A fast food restaurant that is characterized by its famous golden arch, play places, and the famous clown Ronald McDonald. Yet, in the mid-2010s, they threw it all away, rehauling hundreds of franchises across the nation into sleek buildings with a palette of earthy colors. Furthermore, the outside of the franchises was changed from their traditional golden arches and slanted roof to something totally different. The new McDonald's almost looked like an actual office building, a real corporate feel. And sure, while they may have lost some customers who were looking for the nostalgic golden arches and the lovable Ronald McDonald, they introduced an entire new audience to the chain. The newer Earthy colours, and the corporate feel attracted customers who needed to go somewhere to work, get on a study call, or even have job interviews. And sure enough, all the customers who came to the franchise to engage in “serious business” bought Big Macs, Fries, and all the Chicken Nuggets you could imagine. In fact, McDonald's reported sales lifts of up to 10% after the majority of their franchises switched to this newer business look, and they weren’t the only ones. Burger King reported sales lifts of 11.9%, and Taco Bell astonishingly saw a 60% uplift in digital sales, thanks to their promotion of online ordering through their sleek new setup. These moves taken by fast food companies not only show their attitude towards shifting to new, modern architecture, but also a GENIUS new method at attracting new customers through industrial engineering. By making the outside appearance more appealing, consumers poured through their doors!\n\nSecond Strategy: Aesthetics\nYet, none of the architecture changes above would actually matter if the customers had a bad experience, right? That’s exactly correct, but don’t fret, because many fast food businesses also use industrial engineering to make sure that their potential customers get the best experience possible. But wait, how exactly does this happen? Let’s take a trip to Canton, Massachusetts, an unassuming town of around 24,000 people. In that town lies the headquarters of Dunkin’ Donuts. If you go to one of the many franchises in the area, what do you see? Not just the counter, or the oven where they make hashbrowns, breakfast sandwiches, or donuts, but also a seating area with a discreet intention. You see, Dunkin’, as well as so many other fast-food establishments, change their inner floor layouts, shifting tables around, buying new furniture, installing kiosks to order remotely, and even changing the lighting, all to make eating within that franchise more palpable. If you yourself walk into a random Dunkin’ Donuts and take a glimpse of your surroundings, you might actually be tempted to take a seat, just because of how comforting the seating looks. And that’s exactly what fast food establishments aim to do. Regardless of food quality, advertisements, and even social media sponsorships, in order for fast food places to function, they NEED to be appealing to the people who WANT to order. Industrial engineering helps them do just that, especially in terms of indoor decorations and layouts.\n\nSo, in the grand scheme of things, what does this actually mean? With all honesty, after writing this article, I myself will probably be hungry and order a 6-inch veggie delight from Subway, but just remember this. When you, or literally anyone else in the US, go to a fast food establishment, realize that engineering is a key tool that fast food places use to market themselves to potential consumers. Even if their main focus is to sell food that comes out fast, they try to make you happy!"
    },
    {
        "id": 12,
        "title": "Kumimanu Fordycei: A Penguin the Size of a Human",
        "excerpt": "Meet the giant penguins that once ruled the seas. Towering birds whose rise and fall reveal how quickly life can change on our planet.",
        "category": ["Creature Profile", "Biology"],
        "author": "Aniketh Narra",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image12.jpeg",
        "date": "2025-12-29",
        "content": "I’ve always loved penguins. Every time I visit the zoo, I rush straight to their exhibit and watch them waddle, swim, and dive around. One time, I even jumped when a diver dropped into the tank to feed them. I honestly thought a penguin had suddenly grown to the size of a human. I laughed it off, because that would be ridiculous…right? As it turns out, it’s not so ridiculous after all. Approximately 57-60 million years ago, a penguin called Kumimanu fordycei (pronounced Koo-mee-MAH-noo for-DYE-see-eye) actually grew to nearly the size of a human. This giant bird lived millions of years ago, and it was far bigger than any penguin today. So, let’s dive in and explore how this massive penguin lived, hunted, and disappeared! \n\nWhere and When was it found? \n\nScientists discovered the fossils of this enormous penguin in New Zealand, hidden inside giant boulders cracked open by crashing tidal waves. These fossils are over 50 million years old, long before humans even existed. Back then, New Zealand and Australia were filled with giant animals roaming the land and oceans. Imagine a world where penguins could be as tall as your parents and other creatures were just as enormous. It was like a real-life Jurassic park, but for birds! With only a few fossils to study, though, one big question remains: what did this giant penguin actually look like? \n\nWhat did Kumimanu fordycei Look Like? \n\nKumimanu fordycei was huge. It stood about 1.6 to 1.7 meters tall. That’s as tall as the average woman today. Weighing in at around 340 pounds, it was way heavier than any human you know. To put that in perspective, the largest penguin alive today, the emperor penguin, only weighs 55 to 100 pounds and stands about 1.1 to 1.2 meters tall. That means Kumimanu was a real giant compared to today’s penguins. It had a strong, powerful beak and short, sturdy wings which were perfect for swimming, just like modern penguins. And even though it was enormous, it hunted and ate in a similar way to the penguins you see at the zoo today. \n\nWhat did it Potentially Eat? \n\nSince Kumimanu fordycei couldn’t fly, it did all of its hunting underwater. Its diet was a mix of fish, squid, and other slippery sea creatures. With its long, pointed beak, it could snatch prey quickly while swimming. Because it was so big, this penguin could chase after significantly larger animals than today’s penguins are capable of pursuing. Its massive body also allowed it to dive deeper and stay underwater longer. That means it had access to food that smaller penguins could never reach. But even with all that size and strength, this giant penguin still had predators waiting for it in the ocean. \n\nWhat were its Predators? \n\nEven though Kumimanu fordycei was huge, it wasn’t completely safe. Big ocean animals could still hunt it, but there actually weren’t many of these predators around when it lived. This lack of danger is one reason penguins were able to evolve into such giants! The real trouble came from predators that targeted their eggs and chicks. Just like modern penguins, their young were small, helpless, and easy for other birds to snatch up. Over time, new predators moved into the area. Seals, one of the biggest threats to penguins today, spread into the Southern Hemisphere and started hunting both the giant penguins and their chicks. New predators and changes in the environment made survival even harder for Kumimanu fordycei. \n\nWhat Caused their Extinction? \n\nSo why aren’t these penguins waddling around today? Scientists aren’t completely sure, but they have some good clues. About 300,00 years ago, Earth’s climate began to cool and ocean currents shifted. These changes affected the availability of the penguins’ main food sources, like fish and squid, making it harder for them to survive. At the same time, new predators such as seals appeared in the Southern Hemisphere. These predators didn’t just hunt the penguins, but also competed for food and space. Combined with a shrinking habitat and colder waters, these environmental pressures caused Kumimanu fordycei populations to decline, eventually leading to their extinction. However, while the giants disappeared, smaller penguins found ways to survive. \n\nNow, you might be wondering why the smaller penguins survived. Weren’t they facing the same problems? Well, their size actually helped them. Smaller penguins needed less food and less space, so they didn’t compete as much with seals and other predators. Their tiny bodies also made it easier for them to hide. Many small penguins could slip into burrows or tight spaces where larger predators couldn’t reach them. A great example is the little penguin, which still lives in New Zealand today. Its small size helped it survive while the giant penguins disappeared. \n\nWhat started as a funny moment at the zoo turned into a glimpse of how strange Earth’s past really was. Giant penguins like Kumimanu fordycei once thrived, but as oceans changed and new competitors appeared, adaptability mattered more than size. You can still see that same pattern today in animals all around you, as species survive by adjusting to a changing world rather than overpowering it. The story of these giant penguins reminds you that nature is always evolving, even when the changes are easy to miss. Scientists are still studying their fossils to figure out how quickly Kumimanu grew to such enormous size, how it moved in the water, what its full diet looked like, and why its population declined so dramatically, questions that show there’s still a lot we don’t fully understand about these incredible birds."
    },
    {
        "id": 13,
        "title": "Three Weeks of Work",
        "excerpt": "Having productive habits is easier said than done. But throughout attempts to get good habits, personal experience leads to one question: does it really only take 21 days to build habits? ",
        "category": ["Psychology", "Debunked"],
        "author": "Sophia Huang",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image13.png",
        "date": "2025-12-29",
        "content": "“Do it for 21 days, and it’ll become a habit.” \n\nWhen I start doom-scrolling, my algorithm loves to taunt me with self-improvement videos titled “How to Stop RUINING Your Life with these Fifteen Helping Habits.” Then, when I also decide to start scrolling through the comments instead of actually listening to the video, I see at least forty commenters declaring, “Do it for 21 days, and it’ll become a habit.” \n\nI fell for that propaganda! I got myself off of my couch and actually attempted to improve myself! So when those 21 days were up, why did I not feel any more inclined to continue what I was doing? Why was it not part of my routine to sit down, meditate, and journal out my goals? \n\nTo answer my question, I had to search the internet, demanding to know why. What I saw was the general consensus: habits usually take at least two to five months to develop. \n\nOf course, that left me with more questions, like the following: why did we decide to use the 21-day myth as a rule? \n\nIt’s the same reason why I actually tried to take action to improve myself. 21 days is a rather small amount of time, even less than a month. It seems like it would be easy to keep on doing something for 21 days. The end goal is in clear sight; all you need to do is commit for 21 days before you no longer have to think about doing it. \n\nThe 21-day rule does motivate some people to actually start on their goals, but it also un-motivates them after the 21 days are up. When nothing happens after 21 days, people may become discouraged to actually continue building their habits and stop altogether. \n\nFor example, people never fulfill New Years’ Resolutions, which are usually an overly ambitious goal that you make, vowing to change your whole lifestyle and identity. When people see no change beyond the three week mark, they decide that their goals are too much for them. Exercise requires too much mental energy to remember to do, meditating takes too much time to get settled, and everything else does not come naturally, even after spending three long weeks trying. \n\nIt’s not as simple as that. Some things require more time than just three weeks to become full habits, especially considering how complex they can be. If the action feels unrewarding and unhelpful, it’s only right to decide that you don’t need to continue doing it. If you cannot do it often, because something or someone physically stops you, then no habit will form. Some people may not be able to form a habit of exercising, either from the fact that they will gain little enjoyment from it or that they may be physically unable to move their body in such a way. \n\nHowever, some things can be done in even less than three weeks. So many factors impact the time frame, but most of them are rooted in the good that comes from doing the action. When you are happy when doing something, you are more likely to continue doing it. If your family and friends encourage you to act in a certain way, then you’ll follow their judgement. If you are faced with the same action every time you are in a certain location, that location will connect to the action and allow you to repeat. If you already have a routine, you can slip the action into part of it without needing to rearrange your whole life. People may be easily convinced to floss more, because they already have a routine of brushing their teeth in a certain location that allows stronger connections with the flossing action. \n\nTherefore, there is an uncertain amount of time needed to actually form a habit. While habit formation is definitely not around the three week mark like the 21-day rule states, it is no rigid time frame. Some take as little as a week, some as much as dozens of months. \n\nThe 21-day myth may have been a lie, and forming good habits is a lot more difficult than just putting in the work for three weeks. Still, it’s hardly like this has changed my goals or anything, just made them a lot farther to reach."
    }, 
    {
        "id": 14,
        "title": "Nature vs Nurture: Are Criminals Born Or Made?",
        "excerpt": "From a simple story to one of the biggest debates of our time – can the criminals we shun, actually help their behavior, or is it just programming?",
        "category": ["Psychology"],
        "author": "Riya Pawar",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image14.png",
        "date": "2025-12-29",
        "content": "A few years ago, I heard a researcher talk about two kids at a school he was working at. One would steal lunch money. Not because he needed it, but because he enjoyed the thrill. 15 years later, the kid grew up to be an accountant with a stable job and income. Another student who was quiet and polite back then, ended up in court years later due to a number of burglaries. These two went to the same school, had the same teachers, and  a relatively similar upbringing, and yet, two completely different outcomes. \n\nThis, and many other situations, raise the question: how much of who we are is influenced by the  situations we find ourselves in and how much is already built into us through genetics? \n\nThe Stanford Prison Experiment, conducted by Philip Zimbardo in 1971, is one of the most well-known and influential psychology experiments to this day. A group of college students were offered a summer job where they were assigned as either a prisoner or guard and locked in the basement of Stanford University. Both groups conformed to their expected roles and let the environment influence their behavior. The guards began acting violent and harsh, while the prisoners became helpless and stressed. One prisoner even went as far as to refuse leaving because he wanted to “be a good prisoner”. Deindividualisation kicked in as people lost their sense of personal identity, and conformity pushed them to go along with what others in their group were doing. Some guards even felt cognitive dissonance but still acted according to their roles. The experiment supports the nurture side because it demonstrates how much behavior can be shaped by environment and social pressures.​​ The students’ actions weren’t predetermined, rather they responded to roles, group expectations, and the authority figures. This shows that circumstances and experiences can strongly influence how people act, making nurture a plausible explanation for behavior. \n\nThe Asch Conformity Experiment also shows how strongly social pressure can shape behavior. In the study, participants were asked to identify which line most closely resembled the reference line in a group setting. There would be 4 actors and 1 real test subject. The actors were told to answer incorrectly, even if the correct answer is obvious. The task was so simple that even a 5 year old could do it, but when the rest of the room chose the wrong answer, so did the majority of the participants. On the other hand, when test subjects were asked to write their answers, they were less likely to conform to the group. This shows how easily social pressure can change our actions. \n\nTogether, these studies show how quietly our environments can steer our behavior. But that’s only half the story. \n\nThomas Bouchard wanted to study the impact of genetics on personality, and the Minnesota Twin Experiments was his way of doing so. By examining identical twins who had been raised in completely different environments, he found something surprising. Even though the participants had gone to different schools, had different friend groups, and their lifestyles were nothing alike, they shared many of the same core traits. One specific case was especially surprising. The “Jim Twins” were separated at birth, but later reunited at the age of 39. According to Lina Winerman at the American Psychological Association, the twins were “ both named Jim, had first wives named Linda and second wives named Betty. Both chain-smoked, drove Chevys, served as sheriff's deputies and vacationed on the same beach in Florida.” These coincidences supported Bouchard’s hypothesis that genetics play a substantial role in shaping personality, behavior, and even certain life preferences. The goal of the experiment was to show that genetic traits can remain consistent even when people are raised in very different settings. \n\nWhen we look at these studies side by side, it’s clear that human behavior isn’t just shaped by one force. Both the Stanford Prison experiment and Asch Conformity experiment show how powerful social pressure can be and how people change themselves to fit in with norms. The Minnesota Twin experiments also show how genetics and biology can influence us as well. \n\nSo which one is it? Nature or nurture? Our innate tendencies or our environment? \n\nIt’s actually both. The human brain is extremely complex and even has a reputation as being the most complex object in the universe due to its billions of neurons and connections. Our genetics provide a blueprint for our impulses and natural inclinations. Additionally, our experiences shape how those tendencies actually show up. \n\nUnderstanding the balance between nature and nurture can be crucial in courts. Lawyers and forensic psychologists constantly sort out whether a person’s actions can be justified. For example, a biological leaning toward being impulsive can soften consequences, but it doesn’t replace responsibility. At the same time, growing up around violence or instability can give context to why someone makes certain choices, even if it doesn’t excuse them. Modern criminology typically looks at both sides of a case before deciding on a fair outcome. Courts make decisions based on a clearer picture of what pushed or guided them toward that outcome. \n\nAt the end of the day, we know that a combination of different factors shape us into who we are. Recognizing this blend doesn’t only help lawyers, but it can also help us understand why people do what they do. \n\nWith that being said, genes don’t automatically mean destiny and situations aren’t everything. We can create environments that bring out the best parts of who we already are. Proving that who we want to become is not just written in our DNA, but also in the life we choose to live."
    },
    {
        "id": 15,
        "title": "Pittsburgh: A City of Hills, Bridges, and Steel",
        "excerpt": "Understand how the scenic and beautiful natural landscape and surrounding geography shape Pittsburgh's identity as the “Steel City.”",
        "category": ["Engineering", "Chemistry", "Earth Science"],
        "author": "Mikul Jain",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image15.webp",
        "date": "2025-12-29",
        "content": "As soon as one exits the Fort Pitt tunnel from the South Side neighborhood of Pittsburgh, a breathtaking, beautiful, and majestic view of downtown opens up to the eye. In the west lies the mighty Ohio River, once considered “Great River” by the Native Iroquois tribes. Its waters make their twists and turns as far as one can see. In the east lies a scenic, perhaps even picturesque view of the gentle, rolling hills of the Appalachian Valley. These hills cast a towering view of the lively, bustling city down below where industrial and commercial neighborhoods like the Strip District and Squirrel Hill lie. On a clear summer day, one can even spot the infamous Cathedral of Learning, the tallest university campus in the western hemisphere. The hill adjacent to the tunnel displays one of the greatest transportation innovations by man: the incline. These red cabin cars make their way up and down the hill and add to the authenticity of the surrounding landscape. Finally, to the north lie the tall skyscrapers of downtown including the famous US Steel Tower (UPMC Tower) with its black facade, as well as PPG Place, also known as the “Batman building.” Now that the beautiful picture is painted, it is time to dive into the science behind Pittsburgh’s geography, its man-made wonders, as well as its historic hub as a steel manufacturing powerhouse. \n\nFirstly, the geography of the greater Pittsburgh area is what is known as a “plateau.” By definition, a plateau “is a flat, elevated landform that rises sharply above area on at least one side” (National Geographic, 2023). This can be acknowledged when considering the fact that western Pennsylvania is often noted as more hillier, and higher in elevation than the nearby plains and flatter lands to the west in Ohio. How did this plateau develop in the first place? Nearly 300 million years ago, Pittsburgh lay in a tropical, swampy, and humid area near the equator. Why this is important to understand is that much of Pittsburgh’s largest industries like for example coal, are the result of coal deposits that come from fossilization of ancient flora and fauna from tropical areas . Coal, as defined as “a hard, black substance that is dug from the earth in pieces” (Cambridge Dictionary, 2025). Coal therefore consists of many molecules that chemists call “hydrocarbons.” A hydrocarbon is a molecule that consists of two basic, key elements, carbon and hydrogen. These two elements are the basis of all life on our planet and what channel much of the energy in our bodies, our ecosystem, as well entire machines and vehicles. When hydrocarbons are burned or heated, they release a great amount of energy that can be used to power things like trains, engines, and even nuclear reactors. Much of Pittsburgh’s steel mills that stand today operate on from the natural coal deposits that are found underground in western Pennsylvania. Fast forward into the last 700,00 years or so, and Pittsburgh lied in a glacial area. Glaciers are defined as “a mass of ice so large that it flows under its own weight” (National Park Service, 2025). Around 20,000 years ago during the endings of the last ice age, these glaciers started to collide into each other and eventually melt. Their paths and intersections in which they collided and melted resulted in the three Pittsburgh rivers that are widely known today as the Allegheny, Ohio, and Monongahela. Today, this intersection lies at Point State Park where the three rivers meet. These rivers have played a crucial role in Pittsburgh’s development over the last few decades. Since the time of the Native Americans thousands of years ago, these rivers were used as a way of transportation for navigation much of the interior of the United States. In recent years, many shipping companies have used them to transport important goods like steel and even coal. Steel is by far the most valuable material that Pittsburgh produces today and even for much of its history. How exactly is steel produced? The science behind steel production lies in heating of coal. Sound familiar? Well, this is exactly what interlinks Pittsburgh’s greatest natural resource to its greatest man-made resource. First, coal is heated in special ovens at temperatures of over 2,000 degrees Fahrenheit! After the coal is heated and melted, it is mixed with limestone and iron ore deposits (they also are found naturally in the nearby Appalachian mountains). The molten, iron rich mixture is then refined in a way that causes it to get reduced in its carbon form. This carbon form is what is called steel. This strong, flexible, and flame resistant material is the basis of many of Pittsburgh’s greatest wonders. For example, many of the gold suspension bridges in downtown are all made from Pittsburgh-produced steel. Nearly every one of Pittsburgh’s 446 different bridges has a level of steel composition that makes them durable and sturdy enough to withstand all kinds of weather. Everything from the famous inclines, the bridges, to even the US Steel Tower itself is made with steel foundations! Now that really goes to show why Pittsburgh is given the “Steel City” title. \n\nThe connection between geography and the science of natural resources and steel manufacturing aren’t just random and coincidental, but rather an interlinked and intertwined understanding of Pittsburgh’s establishment and renownedness as the “Steel City.”  The vast hills that resulted from the collision of tectonic plates millions of years ago, to the formation of three unique rivers from glacial activity and the existence of ancient and tropical flora underground shape Pittsburgh’s reality as one of the industrial and manufacturing powerhouse of the United States today. Understanding the science helps understand the history and future of a city built and shaped by its beautiful, scenic, and picturesque environment."
    },
    {
        "id": 16,
        "title": "Photosynthesis: Explained",
        "excerpt": "Not many people know what photosynthesis really is. Dive into the world of plants and how sunlight to you is food to them!",
        "category": ["Biology"],
        "author": "Tanav Gunti",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image16.webp",
        "date": "2025-12-29",
        "content": "When I was a wee little freshman in biology, there was one unit that I just couldn’t get my head around. Photosynthesis. The processes are complex, the reactions are complex, and honestly, even the names are complex! I mean, how is anybody supposed to memorize the path electrons take in the electron transport chain to get to the ATP synthase?  If you didn’t understand a single thing I said, then don’t worry, I am going to explain the process of photosynthesis in an easy, understandable format so you can ace your test! \n\nPart 0: Introduction \n\nPhotosynthesis is the process by which plants make glucose from carbon dioxide, water, and sunlight. Basically, it's the way plants make their food. The process takes place in the chloroplast of the plant, usually located in the leaves. The greenness of the leaves that you see is actually the light that is reflected at you. Chloroplasts usually absorb blue-red-purple rays of light and reflect green rays. \n\nThere are two main parts of photosynthesis: Light-dependent reactions and light-independent reactions.  Light-dependent reactions take place in the thylakoid membrane, while the light-independent reactions take place within the stroma of the chloroplast. Both of these parts are split into multiple smaller reactions that I will explain further. \n\nThe main reactants (molecules used in the reaction) of photosynthesis are water (H2O), Carbon dioxide (CO2), and sunlight. The products of these reactants are glucose (C6H12O6) and Oxygen gas (O2). A common way to show these is: \n\n6CO2​ + 6H2​O + light → C6​H12​O6​ + 6O2 \n\nNote that there are multiple copies of some of the compounds, such as the 6 carbon dioxide molecules, 6 water molecules, and 6 oxygen molecules. That happens in order to keep the balance between the two sides the same. It is impossible for a carbon molecule to appear in the products if there were no carbon molecules in the reactants. There are many other little compounds to remember in the reactions, but these are the main inputs and outputs of photosynthesis. \n\nPart 1: Light-Dependent Reactions \n\nThe very first reactions of photosynthesis are called light-dependent reactions. Like the name suggests, these are the reactions that are driven by sunlight. The basis of these reactions is sunlight exciting electrons, meaning giving them power, so that they can use that energy to activate processes within the chloroplast. These reactions take place in the thylakoid membrane of the chloroplast. Thylakoids are these tower-like structures inside chloroplasts that contain chlorophyll (the green pigment that absorbs sunlight) in their membranes. \n\nThe Electron Transport Chain \n\nThe electron transport chain is a series of proteins that transport the electrons to their final destination. In the process, the electrons get charged up by a few of these proteins and are used to power a protein at the end of the chain, which I will get to. \n\nSo, how are the electrons even obtained? They don’t appear out of nowhere. Well, let's give a little thanks to water for generously splitting up to provide these electrons. These water molecules split into oxygen gas, H+ ions(positive hydrogen ions), and electrons. \n\nPhotosystem II \n\nA photosystem is a protein that absorbs sunlight and converts it into usable energy in the form of charged electrons. So, Photosystem II is the first photosystem in the light-dependent reaction. The name is a bit confusing, but its name comes from the fact that Photosystem II was discovered after Photosystem I. Blame the scientists, not me. \n\nThis photosystem charges up the electrons and sends them down a series of proteins known as protein pumps.  These protein pumps are activated by the energy in the electrons. Remember those extra H+ ions from the splitting of the water molecules? The protein pumps force the ions into a space inside the thylakoid membrane (called the lumen or the thylakoid space) that is already jam-packed with H+ ions. The force of a high concentration of ions on one side and a low concentration on another side makes what's called a gradient. This comes into play later. \n\nPhotosystem I \n\nThis is another misleading name for a photosystem. Like I said before, Photosystem I was discovered before Photosystem II, therefore the names. After the electrons pass through the protein pumps, they are exhausted of most of their energy. Photosystem I recharges the electrons so that they can be sent to the light-independent part of photosynthesis, or the Calvin Cycle, as NADPH. Two electrons turn NADP+ and a H+ ion into NADPH, which acts as an electron carrier. \n\nATP synthesis \n\nI already talked about the gradient that the opposite concentrations of H+ ions make. So how does the plant use it? Well, basic science tells us that high concentrations want to go toward lower concentrations. If you add something that can capture energy during this already natural process, you can get a reliable energy source. ATP Synthase acts as this in between. ATP Synthase is a protein that spins when H+ ions go through it, creating the energy needed to make ATP from ADP. Think of ADP as an uncharged battery, and ATP as a fully charged battery. ATP synthase is the charger cable that charges ADP into ATP. ATP is then sent along with the NADPH into the Calvin Cycle. \n\nQuick Summary of Light-Dependent Reactions \n\nThe entirety of the light-dependent reactions is based on the charged electrons passing through the electron transport chain. If you need a quick review of light-dependent reactions (or just don’t like reading), then this should help: \n\n - Takes place in the thylakoid membrane \n\n - Electrons are split from water molecules \n\n - Charged in Photosystem II \n\n - Used to transport H+ ions into the lumen to create a gradient \n\n - Electrons are charged again in Photosystem I \n\n - Electrons are combined with NADP+ and H+ to make NADPH, which is sent to the Calvin Cycle \n\n - ATP synthase turns ADP into ATP from the energy gradient, which is sent to the Calvin Cycle \n\n Part 2: Light-Independent Reactions \n\n Light-independent reactions take place in the stroma of the chloroplast, or the area in between the thylakoids that is filled with a fluid-like substance. Like the name suggests, no light is needed to activate any of the processes. This is the reaction that produces glucose, the plant’s long-awaited food. Well, almost. The outcome of the cycle is other high-energy sugars. These sugars are then, in turn, turned into glucose.\n\n The Calvin Cycle \n\n A more common name (and honestly a better name) for the light-independent reactions is the Calvin Cycle. One of the main reasons that I say this is the fact that the reactions are a cycle, in which the excess product of the cycle’s end is used again at the beginning of the cycle. \n\nThis is where carbon dioxide makes its debut. CO2 enters the cycle by combining with a 5-carbon molecule that was already in the cycle (this is the excess product I was talking about). If you do the math correctly, then you should get that a 6-carbon molecule is created. Usually, there are three carbon dioxide molecules that combine with three 5-carbon molecules before they enter the cycle at a time, so there would actually be three 6-carbon molecules created. These molecules are then split into six separate 3-carbon molecules. \n\nNow here comes the ATP and NADPH from the light-dependent reactions. The molecules split up to give their stored energy to the 3-carbon molecules. The energy enables the molecules to have a high energy yield, really meaning that they are charged batteries for the plant to use. 1 of the 3-carbon molecules is turned into a 3-carbon sugar and sent to another part of the plant to turn into glucose, the plant's energy source. The other 5 restart the cycle by turning from 5 3-carbon molecules into 3 5-carbon molecules. The cycle begins anew. \n\nQuick Summary of Light-Independent Reactions \n\n The Calvin Cycle is the basis of the light-dependent reactions. Most of the molecules involved are made of carbon (excluding the energy molecules). Again, here is a short summary: \n\n - 3 carbon dioxide (3CO2) molecules enter the cycle and combine with 3 5-carbon molecules \n\n - The newly-made molecule gets split into 6 3-carbon molecules \n\n - Molecules charged up by ATP and NADPH \n\n - 1 3-carbon molecule exits to become glucose, others reform into 5-carbon molecules to restart the cycle \n\nSummary of Photosynthesis \n\nPhotosynthesis is the way that plants make their energy. The use of electrons in the electron transport chain allows the formation of the energy carriers ATP and NADPH. These molecules, in turn, can make a 3-carbon molecule into an energy-yielding sugar. \n\nPhotosynthesis can be a hard topic. There is a lot to remember and pack into your brain. But when you stand back and look at all of it, the pieces of the puzzle fit into place."
    },
    {
        "id": 17,
        "title": "The Tug-of-War Of Procrastination ",
        "excerpt": "Homework needs to be done…a bit later. Learn why people procrastinate, and hopefully learn why you have it.",
        "category": ["Psychology", "Junior"],
        "author": "Ishaan Sankaran",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image17.avif",
        "date": "2025-12-29",
        "content": "When you have an assignment from Math, Science, English, and all these other classes, what is the first human instinct? Then answer the question however you want, I think that is a tad bit more engaging than starting off with 3 questions. Once we get that due date, we're able to rest, knowing we can put it away till the day before it’s due. I've even done this countless times from middle to high school. Even now, it’s still a common habit I still have. On the day before we were scrambling to finish the assignment we had been given a week ago, while also completing other assignments we had been given in school. Everything piles up, and we’re put under immense levels of stress. This can all be summed up in one word: Procrastination. And guess what? It’s not really about being lazy! \n\nProcrastination is a common thing among people of all ages. Many students procrastinate in school, but even beyond that, as many as 20% of adults are true procrastinators. \n\nOur brains start to order things by short-term benefits and long-term benefits. As a kid, did you ever remember playing a game where you could buy things with tokens? You could either buy a cheaper thing at that moment, or you could save up to get that larger prize. A lot of us have chosen the smaller thing, thinking we could get that larger prize later. That’s similar to procrastination– prioritizing short-term benefits and rewards over those that are long-term. \n\nWhere does this habit come from? Was I born with it? Does it come from my parents’ genes? Nah. You actually learn procrastination as a habit. Procrastination becomes a way to avoid responsibility, to complete or begin tasks. Other than being a priority of benefits, procrastination can also arise from emotions that you feel after being tasked with something you don’t really want to do. \n\nBeyond benefit, people procrastinate because they fear failure or have self-doubt and anxiety. Mental health issues such as ADHD, not paying attention or being impulsive, depression, eating disorders, and even perfectionism. The behaviors caused by these issues could vary from eating snacks to get rid of the discomfort to not being able to start the task because you're too worried about how it may turn out. \n\nIn the end, procrastination is a habit that changes and shapes your brain. So, let’s take a look at what exactly is happening inside your brain! \n\nInside your brain, two parts called the limbic system and the prefrontal cortex clash. The limbic system is the brain’s “emotional center,” and the prefrontal cortex is the brain’s “decision-making center.” Your brain plays a game of tug-of-war as the prefrontal cortex and the limbic system fight. The limbic system opts for a change in scene and wants to flee from unpleasant tasks or work, and it pulls on the rope to make you do something more engaging, like scrolling on your phone. Your prefrontal cortex wants you to continue to do your work and follow the “planner” in your brain to complete all your tasks. So, when you’re working and the limbic system pulls the rope past the line to win, you procrastinate. \n\nNow that you know more about what procrastination is, why it happens, and what can cause it, how can you solve it so you can get back to doing your work and not have to pull an all-nighter before the day everything is due? \n\nFind a way to outsmart procrastination. Now what does that mean? That means finding a way to make your brain react differently to an unpleasant situation and break the reward-based learning loop. Mindfulness is a perfect way to do this. Mindfulness allows you to become aware of your surroundings and makes you able to curb anxiety and break negative habits– like procrastination. With mindfulness, not only does it break procrastination there are many other great benefits, such as a rise in curiosity. \n\nAnother way you can break procrastination is by being smart about your surroundings. If you put yourself in a situation where you’re with your friends and you’re unable to focus on the work in front of you and engage in too much conversation (not pertaining to your work), that itself can be a type of procrastination. However, the small things in your surroundings matter too. Such as your phone. \n\nWe all love to scroll or play games on our phones, and when our limbic system locks onto it and plays that game of tug-of-war with the prefrontal cortex, it usually wins out, and you’re staring at the screen while your work is undone in front of you. To overcome this, you can simply remove the distraction by leaving your phone somewhere else or setting restrictions on it. Or, going back to the reward system, you can use it positively by making a schedule and working until you reach a break. \n\nNow, this all may seem easier said than done, since it’s hard to do this for work you absolutely hate. If you’re in school and you have math homework, a class you absolutely hate, it's very difficult to engage yourself. \n\nSo find a way to motivate yourself. Rather than trying to get something done, find a way to set goals for yourself and learn the content. You never know, you may even find something that is helpful or interesting. This way, you’re more focused and engaged, and you’re more likely to get work done now that you don't have to wait till the last minute. \n\nProcrastination is an issue we all deal with, and the more we do it, the worse and worse the habit gets. It’s not being lazy, as there are so many reasons as to why it occurs: from mental health issues to the prioritizing of rewards. Although it may be hard to pull away from the distractions, you win that game of tug-of-war against your limbic system. Know that it’s possible. You just need to put in that effort and have the right mindset. Hopefully, you’re never pulling an all-nighter, but if you are, you are not in the wrong, your Limbic System is!"
    },
    {
        "id": 18,
        "title": "Sustainable Marketing",
        "excerpt": "As business continues to grow and grow, so does the harm that the government incurs. In order to make a statement and save face, companies are starting to switch over to sustainable marketing, but what does it really mean for them and the environment?",
        "category": ["Psychology"],
        "author": "Sridama Pulumati",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image18.jpeg",
        "date": "2025-12-29",
        "content": "Once, I was shopping with my family, and we came across two different brands of water bottles, one being Nestle Pure Life, and another being some generic brand. Back then, I only focused on the cost of the bottle, so I told my dad, “Dad, let’s buy that one, it’s cheaper than this Nestle Pure Life.” My dad then told me, “Son, the one you want is cheaper, but Nestle made this bottle from recycled plastic.” It was many years later till I discovered that this is what sustainable marketing was all about. \n\nThe first thought when asked about what sustainable marketing is is to answer that, “It’s just things that keep the environment safe, while marketing normally.” While it is true that sustainable marketing is safer for the environment, it is so much more than that. All these companies that boast their brand as being sustainable, have many reasons to do so. \n\nOne such reason is because people started to take note of environmental conditions. Beginning in the 1960s and 1970s, many authors such as Paul Shepard, Rachel Carson and others started discussing the impacts that humans can have on the environment, and what that would mean for future generations. It also certainly helped that with Albert Einstein’s contributions to the nuclear bomb, and its use, people could see first hand the toll and damage it had on the natural environment,  decimating trees, foliage, and wildlife. \n\nOne of the most important concepts of any business textbook, class, or lecture is the concept of building a strong brand. Branding is one of the best ways for businesses to earn money, because as soon as you’ve memorized their brand, you will always buy their products from them. By following sustainable marketing and practices, a strong, environmentally friendly brand is created in your mind, to which your hands will reciprocate by swiping your credit card or paying for a product with cash. With my dad, what convinced him to buy that Nestle bottle was the fact that they followed sustainable practices, thanks to their branding of being environmentally conscious(and their certificates and actual proof). \n\nThis in turn soon makes a person realize that no, some businesses main goals aren’t to protect the environment, but a few simply use sustainability as an avenue to gain more customers. This in and of itself isn’t wrong, it’s just the business doing its job, but when the environmental and social impacts are exaggerated, this is called greenwashing, or false advertising. \n\nLying in any society is generally frowned upon, but when a business does it, it causes irreparable damage to its reputation. When this happens, it causes them to lose many of their customers, their employees, and the trust in their product or service. For example, Volkswagen is one such company, that appears to appear more environmentally friendly, cheated emission tests by fitting the vehicles with a “defect” device, a device that detects when an emission test is occurring and alters its performance. This led to massive financial penalties, lost millions as stock holders lost faith in the company, and faced the fact that their reputation and brand was severely damaged. This, however, led to Volkswagen becoming a climate leader. Due to their green washing, the company knew it was time to change its ethics and embrace no emission vehicles. This led to the creation of its Sustainability Council, and to the decision to decarbonize, with 50 billion euros used to launch the electrification initiative. Soon, the company was rebranded and since then has focused on climate change. \n\nWith Volkswagen’s story, it becomes clear that companies can change, and follow sustainable marketing and practices for a reason. As we have seen so far, some of these reasons are to establish a strong brand, gain customer loyalty or trust by being environmentally friendly, and to recover from the public’s loss of faith in your company. But one crucial reason other than giving back to our planet is to increase innovation. \n\nWith customers and the public demanding more sustainable practices, such as less greenhouse gas emissions, waste, and pollution, this can lead to companies rethinking how they produce, deliver, and promote their product or service. Many people skip over the benefit of innovation when engaging in sustainable marketing. While doing sustainable marketing can gain customer trust and loyalty, and more customers, innovation is what helps the company grow beyond, and what helps the customer. When companies start innovating, they can optimize their products, improve upon their services, and just in general become a better company(setting themselves apart from their competition). One such benefit to the customer when a business innovates is that they receive their money’s worth from the company.\n\nSustainable marketing is no longer an optional strategy-it’s now a must for all companies in this rapidly changing economy. As more and more people learn about the environment, and how it’s being impacted by people, the businesses that are transparent, follow ethical practices, and value the customer gain customer loyalty and trust. Ultimately, sustainable marketing isn’t all about caring for the environment. It’s also about bettering yourself through innovation, gaining customer trust and loyalty, and building a strong brand."
    },
    {
        "id": 19,
        "title": "The Real Life Bigfoot: Gigantopithecus Blacki",
        "excerpt": "Stories about Bigfoot have fascinated people for decades. Descriptions of a towering, ape-like creature roaming dense forests appear in cultures around the world, from North America’s Bigfoot to the Himalayan Yeti.",
        "category": ["Biology", "Creature Profile"],
        "author": "Aniketh Narra",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image19.jpg",
        "date": "2025-01-31",
        "content": "Stories about Bigfoot have fascinated people for decades. Descriptions of a towering, ape-like creature roaming dense forests appear in cultures around the world, from North America’s Bigfoot to the Himalayan Yeti. While these creatures remain legends, the idea of a giant ape is not entirely fictional. In fact, a real primate once existed that was massive enough to make these myths seem believable. That ape was Gigantopithecus blacki (pronounced jigh-gan-toh-pi-THEE-kuss BLAK-ee), an enormous primate that lived alongside early humans in Asia. Similar in appearance to a modern orangutan but far larger, Gigantopithecus blacki is believed to be the largest ape to have ever lived. Standing significantly taller and weighing far more than any ape alive today, its size alone set it apart from all other primates. By examining the fossils it left behind, scientists have been able to uncover where it lived, how it survived, and why such a powerful creature ultimately went extinct. \n\nWhere and When was it found? \n\nFossils of Gigantopithecus blacki have been found in southern China, Vietnam, Thailand, and Indonesia. The very first discovery happened in 1935, when a scientist noticed an unusually large tooth being sold in a Hong Kong market. From discoveries like this, scientists believe this giant ape lived in dense forests across China from about 2.3 million to 215,000 years ago, with its population beginning to decline around 300,000 years ago. However, since most of what we’ve found are teeth and jaw fragments, one big mystery remains: what did this massive creature actually look like? \n\nWhat did Gigantopithecus blacki look like? \n\nBecause complete fossils haven’t been found, scientists rely on teeth and jaw fragments to estimate what Gigantopithecus blacki looked like. These remains make it difficult to know its exact proportions, but the evidence points to a giant ape unlike anything alive today. Researchers estimate it stood about 9 to 10 feet tall and weighed anywhere from 440 to more than 1,200 pounds. That makes Gigantopithecus blacki the largest ape ever discovered, far bigger than the Eastern Lowland gorilla, the largest ape living today. This extreme size shaped nearly every part of its life, including how it ate and survived in its environment. \n\nWhat did it Potentially Eat? \n\nGigantopithecus blacki’s massive body and specialized digestive system allowed it to process large amounts of tough, fibrous vegetation. This advantage helped the ape survive on abundant but low-quality foods such as bamboo. Researchers think its diet included bamboo shoots, stems, fruits, and tubers. Evidence from fossilized teeth and jaws shows clear adaptations for grinding and crushing plant material, which supports its classification as a herbivore. Overall, its physical structure and dental features point to a plant-based diet suited for dense forests. Understanding its diet helps clarify how Gigantopithecus survived in its environment. Understanding what it ate helps explain how it thrived, but diet alone did not determine its fate. To fully understand its survival, scientists must also consider the dangers Gigantopithecus faced. \n\nWhat were its Predators? \n\nBecause of its massive size, adult Gigantopithecus blacki likely had very few predators. However, their young were much more vulnerable. Predators such as tigers, leopards, and crocodiles near rivers may have hunted juveniles when they were small and defenseless. Even so, fully grown adults were so large that most predators would have avoided them altogether. Their size alone likely acted as a deterrent, and parents could defend their offspring if danger appeared. But if predators weren’t a major threat, one big question remains: why did Gigantopithecus blacki still go extinct? \n\nWhat Caused their Extinction? \n\nFor a long time, scientists suspected that Gigantopithecus blacki went extinct because its forest home slowly disappeared. Newer research supports this idea. Around 700,000 years ago, dense forests filled with pine, birch, and chestnut-like trees began to shrink. In their place, open habitats with large grasslands spread across Southeast Asia. This shift made survival much harder for Gigantopithecus. It depended on forest plants for food, and as those plants became scarce, finding enough to eat grew difficult. At the same time, tectonic changes in the region altered the climate, further changing habitats and food availability. While the environment was changing rapidly, Gigantopithecus blacki could not adapt quickly enough. Its massive size, once an advantage, became a disadvantage in a world that favored flexibility. Scientists are still studying whether this extinction happened the same way everywhere or if different populations faced different challenges. But one thing is clear: it wasn’t just change that caused the extinction, it was the inability to keep up with it. \n\nThis pattern becomes clearer when Gigantopithecus blacki is compared to Pongo weidenreichi, a close relative of modern orangutans that lived in the same region. Unlike Gigantopithecus, Pongo weidenreichi showed greater adaptability as forests shrank and environments became more mixed. It was able to adjust its diet and behavior to survive in fragmented forests and changing climates. Gigantopithecus, however, remained heavily dependent on dense forest vegetation and lacked the flexibility needed to cope with expanding grasslands. While both apes faced the same environmental pressures, only Pongo weidenreichi adapted successfully, reinforcing the idea that Gigantopithecus went extinct not simply because its environment changed, but because it could not adapt fast enough. \n\nGigantopithecus blacki remains one of the most mysterious primates ever discovered. Even today, scientists are working to answer key questions about how this giant ape lived and why it failed to survive environmental change. Current research focuses on dental wear patterns, enamel thickness, and isotopic analysis of teeth to better understand its exact diet and how specialized it truly was. Researchers are also refining fossil dates to map population decline across regions and studying whether the ape could move efficiently through forests or adapt its feeding strategies. One major unknown is how flexible its behavior really was, including whether it could climb well, travel long distances for food, or adjust to shrinking forest patches. What is clear is that extreme size and specialization, once advantages, became disadvantages in a rapidly changing world. Gigantopithecus blacki did not disappear because it was weak, but because it could not adapt fast enough. Just as stories of Bigfoot capture our imagination today, the real-life giant ape shows us that the line between myth and reality can be surprisingly thin, and that even the mightiest creatures must adapt or vanish."
    },
    {
        "id": 20,
        "title": "AI in Genetic Testing",
        "excerpt": "Artificial Intelligence has the potential to revolutionize genetic testing, though this brand-new arena of genetics and technology comes with both impressive accuracy improvements, and rising ethical concerns.",
        "category": ["Medicine", "Artificial Intelligence"],
        "author": "Kavin Puri",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image20.jpg",
        "date": "2025-12-29",
        "content": "Artificial intelligence allows us to live in a world where computer programs can perform complex calculations far faster than humans could even begin to solve them, where our smartphones are more powerful than the supercomputers used to control the rockets that placed Neil Armstrong on the moon. Yet, although neural networks have existed since 1951, we’ve only recently begun to utilize their full potential in healthcare for tasks such as diagnosing conditions and identifying the most effective treatments. This shift has largely come from reducing costs and improving accuracy, as over ¼ of global healthcare spending is wasted annually. AI can rapidly analyze a patient's situation and make accurate predictions about crucial health information through its ability to analyze the data of millions of data points from vast datasets. \n\nOne of Artificial Intelligence’s latest applications in healthcare is helping to interpret DNA sequences during genetic testing, which enables the analysis of a patient’s history, assessment of potential disease risks, and guidance of treatment decisions by sifting through the 3 billion base pairs of our nuclear code. However, despite being able to increase the accuracy and efficiency of treatment, the use of AI in genetic testing raises important ethical and reliability concerns. If I were to take a genetic test one day, I would prefer AI to aid in analyzing and interpreting my genetic test results.  I would also want feedback from experienced geneticists and other medical professionals to ensure the reliability of my findings. \n\nAI is often used in genetic testing due to its ability to process vast amounts of genetic data rapidly and efficiently. We have come a long way with the time it takes to sequence the average human genome, reducing it from over 13 years back in 1990 to just a few hours today, a phenomenal feat that could not have been possible without complex algorithms analyzing massive amounts of data. In just 10 years, AI has helped us reduce the cost of analyzing a whole genome (all of the DNA of an organism such as us humans) from $20,000 to under $1,500 , greatly increasing the availability of genetic testing to the public. Most importantly, AI has rapidly increased in accuracy; a recently developed AI algorithm from Harvard achieved a 94% accuracy in detecting various cancer types, surpassing existing AI methods by up to 36%. This level of precision can significantly improve early diagnosis and preventive care, potentially saving someone’s life. \n\nAI can also identify genetic risk factors for genetically related diseases such as cancer and Alzheimer’s, enhancing predictive accuracy and tailoring treatment recommendations to individual patients. One current method of testing for diseases is through Polygenic Risk Scores, or PRS, which calculates the chances of an individual developing diseases based on multiple genetic variants in their DNA. AI enhances PRS accuracy by combining large-scale studies containing thousands of patient data points with Machine Learning models, allowing better risk accuracy for these diseases. \n\nIn addition to analyzing DNA sequences, AI programs have adapted to display a more complete picture of human health through methods that widen the scope beyond our cells’ DNA. For example, metagenomics involves sequencing the DNA of the microbes and bacteria that live in our gut in human samples linked to certain diseases. AI algorithms can analyze terabytes of microbial data to identify disease-related microbial signatures and diagnose conditions such as inflammatory bowel disease and colorectal cancer. Another technique is epigenetic - the study of how genes can be chemically turned on/off - analysis. In particular, AI-powered methylation analysis has been used to detect early-stage cancers by identifying epigenetic changes in blood samples specific to them. \n\nDespite these advantages, relying solely on AI for genetic interpretation has certain risks. First, AI models are only as effective as the datasets used to train them, and a lack of diverse data can lead to inaccurate conclusions & biased results. Furthermore, as AI becomes more prevalent in healthcare, misinterpretation or an overreliance on its findings may lead to poor medical decisions. Using large patient datasets to train machine-learning models may also be a privacy concern, so it is necessary to enforce strict security protocols. Most importantly, AI cannot consider ethical and emotional factors when delivering sensitive health information, replacing a trusted physician’s empathy with machine-generated results.  However, when we consider both the benefits and risks of using AI in genetic testing, it is clear that when used carefully, AI holds tremendous potential to significantly advance genetic research and improve treatment outcomes, ultimately helping the health of millions in the years to come."
    },
    {
        "id": 21,
        "title": "A Journey Into Deep Learning",
        "excerpt": "This article ventures into the heart of deep learning, tracing how machines learn to see, think, and understand in ways that challenge what it means to be intelligent.",
        "category": ["Technology", "Artificial Intelligence"],
        "author": "Arnav Deokule",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image21.webp",
        "date": "2025-12-29",
        "content": "Like many people growing up in the glowing age of screens and gadgets, I spent countless hours trying to find out how machines “knew” things. How did my phone recognize my face? How did a small speaker in my room suddenly recognize my voice and answer questions like a modern day genie? Back then, I used to think that computers were magical items, until I discovered the true secret behind their intelligence. Turns out - they weren’t powered by magic. Their power came from something far more fascinating: the learning minds of machines. These quiet digital revolutionaries, made of nothing but math and code, changed the world. They were the artificial neurons that sparked a new era. This is the world of deep learning. \n\nDeep learning, at its core, is a subfield of artificial intelligence The foundation of deep learning lies in artificial neural networks, structures designed loosely after the neurons in the human brain. A neural network is made of layers: an input layer that receives information, an output layer that makes a prediction, and many hidden layers in between. Each layer is made of artificial “neurons” that perform mathematical operations, passing information forward while adjusting internal parameters known as weights. These adjustments allow the network to gradually improve its accuracy. \n\nTo understand how deep learning truly works, imagine giving a network thousands of images of cats. The network does not begin by understanding what a cat is. Instead, early layers identify simple patterns like curves, edges, or colors. Mid-level layers combine these patterns into shapes such as ears or whiskers. Deeper layers form full concepts—paws, tails, faces. After seeing enough examples, the network learns to generalize, recognizing a new cat it has never encountered. This ability to automatically learn hierarchical patterns from raw data is what sets deep learning apart from earlier forms of AI. \n\nDeep learning also thrives on large datasets. The more varied and abundant the examples, the better the network becomes. Advances in computing power, especially the use of GPUs and specialized processors, have allowed networks with millions—and now billions—of parameters to train on massive collections of images, text, audio, and video. This surge in data and speed is what enabled deep learning to move from research labs into everyday life. \n\nThe results are everywhere. Deep learning powers facial recognition systems on smartphones. It allows virtual assistants to understand natural speech. It drives recommendation engines on platforms like YouTube and Spotify. In medicine, deep learning models detect tumors and diseases earlier and more accurately than many traditional methods. In transportation, self-driving cars rely heavily on neural networks to interpret roads, signs, obstacles, and movement. Even creative tasks—writing, drawing, music composition—have been transformed by deep learning models capable of generating new content from learned patterns. \n\nDespite its successes, deep learning has important limitations. Neural networks are often described as “black boxes” because their internal decision-making processes are difficult to interpret. Understanding exactly why a model made a certain prediction remains a major challenge in AI research. Deep learning also depends heavily on the data it is trained on. If the data contains biases, the model may unintentionally learn and reproduce those biases. This makes responsible data selection and ethical training practices essential. \n\nResearchers continue to push the boundaries of deep learning. Some study how to make networks more explainable, so humans can understand their reasoning. Others focus on making models more efficient, allowing them to learn from fewer examples. There is ongoing work to combine deep learning with symbolic reasoning, giving AI systems the ability to understand logic, cause-and-effect, and abstract thinking. These advancements aim to overcome the current limitations of deep learning and lead toward more general and reliable forms of artificial intelligence. \n\nAs deep learning evolves, it not only teaches machines but also teaches us about learning itself. It forces scientists, engineers, and philosophers to rethink what intelligence means—how it forms, how it grows, and how it can emerge in systems very different from the human brain. The study of deep learning has become a study of both technology and cognition, blurring the line between artificial and natural intelligence. \n\nDeep learning has transformed the world in less than a decade. It writes stories, paints pictures, drives cars, diagnoses illnesses, translates languages, predicts trends, analyzes patterns, and learns constantly. Yet it remains a mystery wrapped in code—an evolving universe of algorithms that both mimic and challenge human intelligence. Deep learning pushes us to understand not just machines, but ourselves. \n\nWe may never fully comprehend how far this journey will take us. But, much like staring at the night sky and wondering about black holes, we can explore. We can learn. \n\nWe can imagine. \n\nAnd that might be the greatest power deep learning has given us—the ability to see the future not as a distant possibility, but as something already unfolding before our eyes."
    },
    {
        "id": 22,
        "title": "The Cheesy Lie We’ve All Believed",
        "excerpt": "Do mice really like cheese or is it just one big cheesy mice-conception?",
        "category": ["Biology", "Chemistry", "Debunked"],
        "author": "Anusha Gupta",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image22.jpg",
        "date": "2025-12-29",
        "content": "Have you ever watched the cartoon Tom and Jerry as a kid? If you haven't, trust me, you are missing out. Until you get a chance to watch it, here’s a recap. Tom is a cat who is always chasing after Jerry the mouse, who is always on the hunt for cheese. \n\nBut wait? Cheese? \n\nTom and Jerry has made cheese the golden treasure at the end of a rainbow, the ultimate prize in the mice world. But did you know that mice don’t really like cheese? \n\nWHAT?! \n\nYes, I’m as shocked as you are. Sure, mice will munch on cheese if there's nothing else around but it is definitely not their favorite food. If you have a huge sweet tooth like me, you better watch out since mice are generally more attracted to sugary foods such as cookies, cake, fruits, as well as grains! Fun fact: if mice can’t find anything to eat, they will actually eat their own droppings. They do this so they can get the nutrients they need out of their bacteria. \n\nDISGUSTING I KNOW!  But hey, you gotta do what you gotta do. I respect the hustle. \n\nThe real question is…Why did this myth even come to be? \n\nThis myth comes from a time where refrigeration wasn’t a thing yet. Since refrigeration did not exist it was hard for families to preserve food. Some ways to preserve food back in the day included hanging meat from the ceiling, storing grains in bags and covering large barrels of cheese with a cheese cloth. Out of all of these options, mice found the cheese the easiest thing to access compared to the meat and grains making it the more appealing food for them to snack on. \n\nAnother reason why mice gravitate away from cheese is because of its smell. I think we all know how pungent some cheese can be. The cheese Limburger is known for being a cheese with the smell of feet and Vieux Boulogne is known for being the world's stinkiest cheese from a 2004 and 2007 study. YUCK, I can smell this stinky cheese through the screen. But the reason mice gravitate away from cheese is because they have a very sensitive sense of smell. This is due to the fact that 1% of their DNA is dedicated to olfactory receptors which are sensory neurons in their nose that detect odor molecules, and they have around 10 million olfactory receptors! We can only imagine how sensitive their noses are with this many receptors. Did you know that mice also have a second nose located in their nasal cavity called a vomeronasal organ and it is used to smell pheromones which are chemical signals released by animals to communicate. Instead of search dogs we need search mice because with two noses, they could do double the work! \n\nLet’s talk about how this misconception actually spread. The root of this misconception would be television and shows from the middle ages. In the play, King Lear, written by Shakesphere, there is the phrase spoken by the character Lear where he uses a piece of toasted cheese to try to catch a mouse showing that the connection between mice and cheese dates back much further back than we thought. This misconception only started there,  but then spread through the use of television which can be seen through the show Tom and Jerry. Animators used cheese as the main food because it was the easiest food item to draw. Way to take the easy way out animators! Just kidding but let’s think about it logically, no one wants to draw 10 pieces of grain every single time, a yellow triangle just seems much more logical and less time consuming. Since it was the most effective way, animators did not draw or animate anything else, spreading the misconception that mice and cheese go hand and hand. \n\nGoing back to my Tom and Jerry obsession, someone needs to tell the animator that Tom is gonna eventually catch Jerry because sooner or later Jerry’s going to ditch the cheese and go for some cake. Now we also know what to actually put in our mouse traps, hint: it's not cheese! \n\nIt is actually crazy how we’ve all grown up believing that mice are obsessed with cheese. But in reality, it’s just one big, cheesy mice-conception."
    },
    {
        "id": 23,
        "title": "Does Hair Actually Grow Faster When You Cut It?",
        "excerpt": "Does hair actually grow faster after you cut it? This article challenges and debunks this myth with the science of hair growth.",
        "category": ["Biology", "Debunked"],
        "author": "Sreenidh Durisheti",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image23.jpg",
        "date": "2026-01-14",
        "content": "On March 11th 2022, TikToker the.osh.01 uploaded a video titled, “Shaving my face every single morning until I grow a full-on beard”. It seemed contradictory– wouldn’t shaving reset facial hair progress? The creator believed that hair grew faster with each shave. With this logic, each cut would make the hair grow faster and faster, eventually leading to a full beard. Nevertheless, the answer is yes: it does reset progress. The.osh.01 has since stopped uploading videos. But his last video, Day 716, shows him with no beard in sight. While the challenge itself was meant for comedic purposes, it challenges a widespread myth: Does hair grow faster after you cut it? \n\nThis myth is commonly pushed by parents, friends, and influencers. As a result, a large number of people believe this myth to be true. When you hear something from people you trust or watch online, it’s easy to accept it as fact. Like many popular myths, repetition makes it feel true. \n\nI once believed in this myth as well, using it as a coping mechanism for the treachery my barber displayed when cutting my hair. The reality is that cutting your hair has little to no correlation with faster hair growth. \n\nIt is believed that this myth originated from the fact that hair appears healthier after a trim. However, the problem with this assumption is that hair growth does not come from the ends of hair. Rather, it depends on your follicle and scalp health. \n\nMany people imagine hair growth as a plant. They think trimming the ends is like cutting off old leaves to help the plant grow better. The key difference is that hair isn’t alive like plants are. The cells that are cut are dead cells. Cutting your hair can make it look healthier and smoother, but that is not correlated to hair growth speed. \n\nGoing back to TikToker the.osh.01., he may have taken on this challenge due to believing in this myth, particularly with shaving. When you shave or trim hair, the new end is blunt and flat. Blunt ends make hair look thicker or darker, which tricks your brain into thinking your hair grew more quickly than before. But it’s just an illusion. The real growth comes from your hair follicles. \n\nHair follicles are the structures within your skin that actually grow your hair. Follicles are tube-like structures that surround the root and strand of a hair. Hair follicles exist in the top two layers of your skin. You’re born with over 5 million hair follicles in your body and over one million hair follicles on your head. As you age, hair grows out of your hair follicles. \n\nIt is mistakenly believed that hair growth comes from the ends of hair. However, since hair growth comes from hair follicles, cutting hair has no correlation to the speed of hair growth. In fact, the average growth of hair per month is 0.5 cm to 1.7 cm or 0.2 to 0.7 inches. \n\nThere is no scientifically proven method for increasing the speed of hair growth. Hair growth occurs by cells forming in the hair bulb under the follicle. Additionally, there is also no method that increases the speed at which these cells form. This includes well known methods such as oil, stress management, supplements and nutrition. \n\nAt the end of the day, the myth that cutting hair makes it grow faster survives because it feels true, not because it is true. Hair may look thicker or healthier after a trim, but that doesn’t change the speed of the follicles working under your skin. Although it's sad, even if the.osh.01 continued the challenge for decades, he would never have a full beard. Ultimately, science debunks this challenge and highlights the importance of researching things before believing them."
    },
    {
        "id": 24,
        "title": "The Miracle Behind Half a Brain",
        "excerpt": "What happens when a child loses half their brain—yet somehow gains their life back? This article explores the extraordinary science of neuroplasticity and the children who redefine what the human brain can do.",
        "category": ["Psychology", "What If"],
        "author": "Vedika Kamble",
        "readTime": "5 min",
        "thumbnail": "https://images.scienceglimpse.org/image24.png",
        "date": "2026-01-14",
        "content": "Imagine this – you’re waiting outside the doctor's office for your diagnosis. Each second stretching longer than the last. Suddenly, your name gets called. You then scramble to gather all your things and head into the office. You anxiously settle down on the chair, as an eerie silence follows. \n\nThe doctor studies your report for a long moment before slowly turning to you,” Our last resort to stop the seizures is surgery.” He looks up to you and says, “It would mean we have to remove the left part of your brain.” \n\nYour heart sinks. You start to reconsider if you heard the right words. Before the shock can even sink in, a thousand questions flash through your mind. \n\nHow is that even possible? Am I going to survive this? Will my brain still function? \n\nWhat we don’t realize is that this is a common scenario, faced by many children diagnosed with uncontrollable seizures confined to a single hemisphere of the brain. \n\nWait... what does that even mean? And why are such extreme surgeries even done? \n\nTo understand this, we need to zoom into the basic building block of our nervous system: the neuron, a cell that transports electrical and chemical signals throughout the body. Neurons transport stimuli at an unbelievable speed, enabling various communication pathways to link the brain and every corner of our body. Their highly branched structure allows them to form connections with multiple neurons, ultimately making an intricate spider web- like network of billions. \n\nEpilepsy is a chronic brain disorder where certain groups of neurons become overreactive and send out abnormal signals, triggering seizures. In most cases, the electrical storm begins at a specific spot in the brain - the ‘focus.’  From here, the signals spread like ripples, but when the seizures stay trapped in only one half of the brain, it’s known as focal epilepsy, typically only affecting one side of the body. \n\nSometimes during the seizures, you are fully aware of everything. Other times, the seizure sweeps in, stealing your consciousness before you know it. \n\nIf such seizures continue at a regular basis, they are proven to cause injury or even death. \n\nIn the most severe, relentless epilepsy cases where even medical treatment fails, doctors turn to a drastic, but lifesaving procedure, called Hemispherectomy. (hemi – half, sphere- here referring to a hemisphere of brain, ectomy- here referring to surgical removal). \n\nA surgery that involves careful removal of the affected half of the brain. Great caution needs to be taken while cutting the sensitive tissue, as one mistake could lead to the destruction of vital neural pathways! \n\nHemispherectomy is considered to be one of the most invasive, yet most successful epilepsy surgery in the world of neurosurgery. \n\nWait, but what happens to empty space left behind? \n\nWell, the surgeons developing the procedure struggled to find an answer. They tried to find various substitutes, and believe it or not, they even tried to fill the empty space with sterile ping pong balls! \n\nUntil they finally concluded that the empty cavity was filled by the brain’s Cerebrospinal Fluid (CSF). \n\nSurprisingly, even after having half of their brain removed, most children still go on to live a full, and remarkable life, even developing personalities! \n\nNot only that, but most of these kids are cured of their seizures, and have the potential to grow their cognitive, linguistic, and reasoning skills. Researchers also discovered an increased number of brain networks in these patients compared to an average, healthy human brain. \n\nWoah, it’s almost like the brain whipped out its own wand and started making magical new neural networks. \n\nBut how does that even work? \n\nIf you cut your phone in half, it’s obviously not going to turn on. So how does the brain still continue to function? \n\nThink of it as a superpower the brain possesses called ‘Neuroplasticity’. The sudden loss of tissue pushes the brain to get into action. It rewires and reorganizes its connections, slowly adopting the role of the removed part. Younger children often show the most dramatic recovery. Their brains are still in a dynamic, growth-heavy stage, making rewiring faster and more effective. Neuroplasticity serves as an essential tool to compensate for the loss of function. \n\nBut the body obviously isn’t going to completely return to a perfect normal state. After the surgery, children face partial vision loss, difficulty in forming thoughts, and weakness in one side of their body. With the help of neuroplasticity their cognitive and physical functions can be developed. Speech and physical therapy can help to strengthen the newly built and developing neural pathways. \n\nThe brain’s ability to adapt and transform is nothing short of a miracle. \n\nThe human brain is full of mysteries and hidden superpowers that we’re just beginning to uncover… but the real question is, how much more is it really capable of?"
    }
]