[
    {
        "id": 1,
        "title": "The Lightless Stars",
        "excerpt": "Diving into the mystery surrounding black holes, including what they are and how they're formed in an engaging and curious manner.",
        "category": "Physics",
        "author": "Ansh Sharma",
        "readTime": "5 min",
        "thumbnail": "https://i.postimg.cc/50bZvDN1/image.png",
        "date": "2025-07-28",
        "content": "Just like many others, I spent my childhood gazing up at the glittering sky — full of stars, constellations, and planets. Back then, I believed space was perfect: ideal, beautiful, and unblemished… until I learned about a terrifying stain. \n\nInvisible, ravenous beasts that would consume anything daring enough to cross their path. \n\nCreatures straight out of science fiction — but frighteningly real. \n\nThe monsters of the cosmos. \n\nThe fallen stars. \n\nThe devourers of light. \n\nBlack Holes. \n\nThe paradoxes of nature itself, black holes, are shrouded in more than just darkness. The mystery of these monsters started with a simple equation and led to the discovery of seemingly missing patches of space. To this day these gaping voids confound the minds of even the greatest physicists with the innocent yet cruel question: What are black holes— and how exactly are they created? \n\nBlack holes, despite their name, aren’t holes at all. Their tremendously dense remnants left behind from collapsed stars. A star is created when its core’s gravity draws together enough dust and gases to ignite nuclear fusion. This reaction generates incredible amounts of energy, heating up the material and causing it to expand outwards. The result is a constant battle with the gravity of the star’s core which greedily pulls it in and the matter which makes every effort to break for. \n\nImagine a balloon where the air desperately attempts to escape the rubber skin that continuously pulls it back in. Inevitably, when the fuel for nuclear fusion runs out, the star has no more energy to expand outwards and collapses in on its core. \n\nIn the case of extremely massive stars, known as high-mass stars, the star goes through a reaction known as a supernova that causes all the matter to explode outwards leaving the core alone in space. Now, if a particularly massive star—more than 25 times the mass of our Sun —collapses, the core that is left behind is so dense that its gravity doesn’t allow even light to escape its clutches. \n\nThus, a black hole is born. \n\nAfter the birth of a black hole, the surrounding space falls into turmoil. The black hole’s gravity draws in surrounding matter, as well as light, creating a dark, seemingly empty patch of space. Most of the matter that is drawn in starts spiraling the black hole, creating a hot, glowing disk of debris, dust, gases, and other matter, known as an accretion disk. Because black holes emit no light and draw in any form of electromagnetic radiation, these disks are the only way scientists can detect them. As these disks orbit the black hole they heat up to millions of degrees, making them glow and emit various types of radiation, unveiling the location of these otherwise undetectable chasms. \n\nA common question is what would happen to any object—or person—unfortunate enough to fall into a black hole’s gravitational field. Firstly, as the object approaches the event horizon, time starts behaving strangely. The event horizon is ominously, yet fittingly named the point of no return, and isn’t a physical surface but rather a boundary in the spherical space of the black hole where anything, not even light, can escape due to the intense gravity (gravity increases the closer you get to an object). Near this edge, the gravity of the black hole starts causing something known as gravitational time dilation: A drastic slowing of time when compared to a distant observer. For the object inside the gravitational field, time would slow down so significantly that mere minutes would correspond to centuries for any distant bystander. This phenomenon only grows as a person nears the core of the black hole otherwise known as the singularity. \n\nIn addition to time dilation, the object would also experience spaghettification — a dramatic stretching caused by the intense gravitational disbalance near a black hole. The side closer to the singularity would experience a significantly stronger gravitational pull than the side further away, creating an effect so powerful it would stretch the object into a long, thin strand — like spaghetti. \n\nNow, one of the greatest mysteries of black holes is the nature of their cores, known as singularities. These singularities compress a finite amount of mass into an infinitely small space. Around these cores the laws of classical physics and quantum mechanics as we know, cease to function in predictable or logical ways. \n\nThis breakdown challenges many scientific equations with one of the notables being the equation E=mc^2. This equation, created by the genius Albert Einstein, relates to an object’s mass with energy. If one were to naïvely substitute in the infinite density of a singularity in place of mass, the solution would imply infinite energy — something forbidden in the framework of physics. \n\nThis paradox provides a glimpse of the strange nature of singularities and indicates the need for a unified theory that can balance physics with the existence of black holes. \n\nA key step of solving these mysteries and logical flaws stems from directly observing black holes. As mentioned before, since black holes do not emit light or any form of electromagnetic radiation, traditional means of observation yield no results. Instead, scientists carefully detect the radiation released from the accretion disks, or the large gravitational waves that are released during the collision of two black holes — a phenomenon first confirmed by LIGO (a large-scale physics observatory designed to detect gravitational waves) in 2015. \n\nThese observations have revealed that black holes come in various sizes: \n\n· Stellar (3-100 solar masses) *\n\n· Intermediate (hundreds-thousands of solar masses) \n\n· Supermassive (millions to billions of solar masses) \n\n· Primordial (hypothetical remnants from the Big Bang). \n\n*1 solar mass = 1.989×10^30 kg \n\nThis wide variety of sizes leads scientists to believe black holes grow through various processes. The current leading theories involve either the black hole drawing in surrounding matter or merging with other black holes. While these ideas uphold when tested with models and indirect observations, a clear explanation still eludes physicists. \n\nA more mystifying theory comes from the famous scientist Stephen Hawking, who theorized in 1974 that black holes may not only grow, but also decay. This is possible through something known as Hawking Radiation, an occurrence where black holes create virtual particle pairs at the edge of their event horizon, due to quantum fluctuations. One of these particles falls into the singularity, while the other escapes as radiation, causing the black hole to shrink in size. This brings about the prospect that over an extended period, a black hole could potentially disappear. \n\nThe idea that something as immense and powerful as a black hole could vanish challenges our understanding of not only these abysses but also our understanding of the universe itself. It raises more questions than it answers that remain hidden from our senses, yet illuminated by the divine vision of mathematics, the language of the universe itself. \n\nAnd even then, these questions only scratch the surface of secrets these voids hide. \n\nOther notions—information paradox, the breakdown of quantum physics around singularities, or white holes, the opposite twins of black holes—continue to humble scientists, reminding us about how much we still have left to unveil. \n\nThese dark, mysterious, and terrifying enigmas test the limits of what we know, tugging that the very fabric of time, space, and reality as we know it. \n\nWe may never truly understand these cosmic chasms. \n\nBut we can try."
    },
    {
        "id": 2,
        "title": "ML: The Best Data Analyzer",
        "excerpt": "Machine learning (ML) is a subset of artificial intelligence that is able to learn patterns and correlations in data.",
        "category": "Technology",
        "author": "Ayush Srivastava",
        "readTime": "5 min",
        "thumbnail": "https://media.istockphoto.com/id/1448152453/vector/big-data-technology-and-data-science-illustration-data-flow-concept-querying-analysing.jpg?s=612x612&w=0&k=20&c=To0lhCrVmDYdSkOUOGxGsjlYe0buj_wwGCDqYhF9p2o=",
        "date": "2025-7-29",
        "content": "Every time Netflix suggests your next binge, or your phone predicts the next word you are about to type, you're seeing machine learning in action. \n\nMachine learning is often a foreign concept to many, yet it is integrated into numerous applications we use daily. Various social media platforms, videos on YouTube, and even products on Amazon utilize machine learning. This subset of artificial intelligence has quietly positioned itself close into the center of our lives, enabling us to interact with it daily.\n\nThe realm of artificial intelligence includes numerous subfields, one of which being machine learning. Machine learning allows systems to actually learn patterns and correlations from data and make predictions and decisions based on what they receive. Machine learning can be used to analyze huge amounts of data to determine patterns or trends in an extremely short amount of time - in fact, the more amount of data the machine learning algorithm contains, the more likely its accuracy will increase. \n\nMachine learning is a learning process that is achieved through the implementation of machine learning models. These models are no more than mathematical formulas - usually complex ones which we don’t need to delve into. These models analyze large amounts of data to improve their prediction accuracy and performance over time without being explicitly programmed. A simple way to think about it is this: imagine a scenario where a small child must classify planes and cars. Rather than just instructing the child that planes have wings, a long body, a tail, and can fly, while cars are much smaller, have no wings or tail, and do not fly, the child is instead given hundreds or thousands of images of either cars or planes. Over time, as the amount of data grows, the child is able to recognize and detect these differences between the car and the plane. This is the heart of machine learning. The ML models learn from the data they’re given through two main learning processes. \n\nThe first method is supervised learning. In this method of learning, all of the data contains labels. Going back to the car vs. plane example, if a ML model was given this data and told to analyze it with supervised learning, all of the data would contain labels, such as “car” or “plane.” The model is able to easily identify which picture is a car or plane based on the label and, through this, is able to detect any differences between the car and the plane and classify accordingly. Numerous practical applications exist for this method of learning for ML models, including medical diagnosis, fraud detection, marketing, and more. \n\nThe second method is through unsupervised learning, which is the exact opposite of supervised learning. In unsupervised learning, labels do not exist for the data - indicating that when the data is passed to the model, the model does not know the labels. The ML model must be able to detect any hidden patterns, correlations, or relationships without any prior experience or examples. Imagine an adult working to analyze consumer spending behaviors. This adult mainly specializes in finding sets of items that are bought together or occur frequently together in consumer purchases. The adult would be that, the majority of the time, consumers buy bread and butter together at the store. Obviously, the relationships that must be determined are much more complex than the one just given - or else why would one need this learning method of machine learning? In this method, the model teaches itself the similarities, differences, and groupings within the dataset. Applications for this method of machine learning include clustering of people based on their types of behavior in different situations (e.g. purchasing, panic, etc.), aiding in customer segmentation for businesses, along with detections in cybersecurity, and even genomic data analysis. \n\nNow, ML models operate through a series of layers containing neurons. The first layer, called the input layer, receives the data. Through this data, the machine learning process is initialized. Next, the model contains one or more hidden layers, which is where core learning and pattern extraction occurs. The more hidden layers a ML model has, the “smarter” it becomes, allowing it to better extrapolate relationships in the data given in the input layer. A model with 10 hidden layers would be able to find distinct correlations in the data much better than a model with only one input layer. However, this model will also run slower than a model with 1 hidden layer due to an increase in training time. Finally, the last layer is the output layer, which consists of the model’s prediction on the data initially given in the input layer. \n\nModels usually operate on training and testing data. To provide accurate results, it is essential that the testing portion is wholly different from the training portion. During the training portion, the data enters the input layer and passes through the hidden layer. In the output layer, models incorporate a loss function. In this step, the loss function measures the model’s predictions against the actual value in supervised learning, while in unsupervised learning, the loss function measures how well the model was able to extrapolate relationships and correlations in the data. Based on these results, the model updates the hidden layer accordingly in order to improve its results on the next portion of the training dataset. \n\nThe testing portion includes data being passed through the input layer and analyzed by the hidden layer. This step is crucial as the training of the hidden layer functions indicate how well the model is able to detect relationships and make predictions on the data. Finally, a prediction is passed through the output layer. \n\nML models are not always 100% accurate - in fact they often are never 100% accurate. To achieve this accuracy, models must be completely right, which means that their hidden layer must be perfect. This is not always the case. To improve accuracy, one must have lots of data in order for the functions in the hidden layer to adjust themselves in the training phase, along with lots of hidden layers as well. By including these features, one can easily improve the accuracy of a ML model. \n\nMachine learning is no longer a futuristic concept - it’s currently being utilized by companies, organizations and researchers across the globe and has already positioned itself in the midst of our everyday lives. Amazon is able to push products towards us through these models, using our previous purchase history as the data. Most importantly, they are able to do this without any human intervention, highlighting the goal of building systems that can adapt and improve on their own. Even without labeled data, ML models are still able to detect anomalies and relationships in data. However, although ML may sound powerful, it is critical to understand its limitations and drawbacks as well. The utilization of machine learning wisely and efficiently is the future of our community. "
    },
    {
        "id": 3,
        "title": "A Universe-Sized Crunch Bar",
        "excerpt": "Discover the ways that the universe could end and how it began - with a delicious candy bar.",
        "category": "Physics",
        "author": "Medhansh Garadala",
        "readTime": "5 min",
        "thumbnail": "https://bigthink.com/wp-content/uploads/2021/09/https___blogs-images.forbes.com_startswithabang_files_2016_06_Observable_universe_logarithmic_illustration.png",
        "date": "2025-07-29",
        "content": "It’s Halloween right now, and you just went trick-or-treating. You’re sweaty, tired, and hauling a big, fat load of candy—so close to just dropping it down and eating it all. And you do just that. Sitting down on a patch of grass, you dig into your pillowcase to find a big blue, king-size Crunch bar. Oh boy. It looks delicious. So, like any chocolate-loving kid, you tear apart the wrapper and bite into the bar. At first it’s good. Real good. It’s crispy, popping all over your mouth and silky smooth. But after a few seconds, it collapses into just crumbs and sugar. It’s gone. That’s what some scientists think will happen to the universe. A Big Crunch. \n\nBut to understand the end, we have to understand the beginning. The beginning for our universe lies within the Big Bang, or the first bite of the bar. Every single thing, time, space, matter, was all compressed into a singularity. “An infinitely dense, infinitely hot point.” Then something triggered. In a fraction of a second, existence itself was born, and the universe expanded faster than the speed of light, unstoppable and vast. \n\nAs the expansion cooled down, the universe worked its magic into creating particles, atoms, planets, stars, galaxies and a special something that breathes within us: life. The flash from beyond 13.8 billion years still echoes today in the Cosmic Microwave Background, a dim glow that remains from a baby universe. Gravity sculpted for eons, forming galaxies like ours, but the story doesn’t stop there. Something interesting was happening as reality was organizing itself. \n\nThe universe wasn’t only expanding, but accelerating. Why? It was because of the invisible push, also known as dark energy. Making up approximately 68% of the universe, it acts as a force that divides. Galaxies race away from each other while the universe stretches away like pizza dough every second. \n\nSo now comes the end. There could be either a crunch, a frozen treat, or a ripped piece of licorice waiting for us at the end of existence. A common theory is the Big Freeze, also known as the heat death of the universe. What if the universe continues to expand forever? Billions and trillions of years of expansion. Every star runs out of fuel, galaxies drift apart too far for interaction, and all that’s left is an empty, cold infinitely expanding space. \n\nAnother would be the Big Crunch, where dark energy weakens and gravity becomes the king, gaining control and pulling everything inward. Collisions, sparks, and heat. Space-time collapses on itself. Everything clusters back into the original point. A dramatic finish for the Universe. \n\nThe last and most violent death would be a Big Rip, where instead of gravity being king, its dark energy. And as it becomes stronger and stronger, it tears apart galaxy clusters, solar systems, planets, atoms, and space-time itself. The tear doesn’t stop until the universe is in shreds. \n\nSo what does this do with a Crunch bar? It’s a simple metaphor for saying how we live inside a cosmic candy, caught between the snap of its beginning and the crumble of its end."
    }
]
