[
    {
        "id": 1,
        "title": "The Atlantic Puffin",
        "excerpt": "The Atlantic Puffin is a tiny, colorful bird with a big personality! Discover where they live, what they eat, and how people are helping them survive.",
        "category": "Creature Profile",
        "author": "Kavin Puri",
        "readTime": "5 min",
        "thumbnail": "https://i.postimg.cc/sxRt55j7/unnamed.png?w=400",
        "date": "2025-08-03",
        "content": "Is that a Penguin?! \n\nNo, but it kinda looks like a Parrot… \n\nThese are the Atlantic Puffins! A relatively small, yet hardy bird, these guys are often called “The Clowns of the Sea” — and for good reason! We will do a deep dive on everything there is to know about the Puffin — from where it lives, to what it eats, and so much more! \n\nWhere can I find them? \n\nPuffins are found throughout the icy regions of the northern hemisphere. If you are out looking for puffins, the best time to do so is during their breeding season, Late April to August. This is when large flocks of puffins come ashore to breed and nest, and you are best off traveling throughout isolated, rocky islands near shore or steep rock cliffs to find them. However, for the rest of the year, they are usually far out at sea and beyond human reach, spending this part of their lives throughout the oceans by themselves. \n\nIf you’re like me and live in the US, your best chances of seeing puffins are traveling up to Maine, where puffins will often nest across the shoreline, or on islands close by. However, they are more common as you travel further north, with large colonies ranging from hundreds to thousands of birds present in colonies that are scattered throughout Canada, Greenland, Scandinavia, Scotland, and especially Iceland, which reportedly has over half of the world’s Atlantic Puffins! \n\nWhat do they look like? \n\nAs we’ve joked around, puffins are kind of similar to how a penguin crossed with a parrot might look — but rest assured, these guys are unique from any other bird species! They carry black feathers that cover their back and arms, and white ones everywhere across the underside of the puffin’s body, which shield it from the harsh cold environment. Alongside the feathers, puffins sport colorful feet and beaks, striped with shades of grey, yellow, and bright orange. In terms of size, Atlantic Puffins are one of the smaller seafaring birds, typically around 11-12 inches long, 8 inches high, and a wingspan of anywhere from 19 to 25 inches (that’s longer than the puffin itself!). But hey, even if Atlantic Puffins may be a bit on the small side, I’m sure they still have a great personality that more than compensates. And guess what — they absolutely do! \n\nHow do they behave and act? \n\nAs previously mentioned, Atlantic Puffins spend a good chunk of their life entirely at sea. The average puffin will spend 2/3 of its entire 20-year lifetime at sea, usually living a solitary lifestyle by itself. Puffins will do everything from eat, sleep, and take care of themselves on the ocean. Throughout a typical day, a puffin will spend a good amount of its time preening itself, which is just a fancy way to say it keeps its plumage controlled and spreads oil throughout it that comes from its preen glands. This oil is what allows the puffin to remain semi-waterproof, enabling it to easily & smoothly propel itself through the water as it swims. Actually, instead of “swimming” like a fish might, puffins often use the waves to propel themselves, enabling them to surf to their next meal! \n\nHowever, the story is entirely different during the breeding season. As spring begins, mature puffins (typically at least 4-5 years old) return to land — usually back to the colony where they were raised as young chicks — much like salmon that travel to their nesting site when they breed. Puffin “nests” aren’t like your typical bird nest; instead, these areas are closer to holes that are made by digging up a chunk of land and vegetation, in which the eggs are laid. Both genders have specific tasks in taking care of the eggs and chicks: males spend more time guarding and taking care of the nest, while the female spends more time incubating the eggs and feeding the chicks. \n\nWhat do they eat? \n\nSpeaking of meals, a puffin's diet is almost entirely composed of small fish, ranging from herring, sandeels, hake, and capelin. However, a puffin may occasionally eat small crustaceans and other invertebrates if food is scarce in an area. Puffins typically hunt for food by flying very close to the ocean surface, sometimes at speeds of up to 50 mph. When it finds food, it lands in a pretty interesting way — since there is no land for it to latch onto and properly land on, most puffins will simply belly flop as they land on the ocean! Once they have caught and eaten enough, they will usually take off by flapping their wings rapidly as they skim the water’s surface, gaining momentum until they can fly again and find another place to repeat the cycle all over again. \n\nPredators & Conservation \n\nThanks to their small size and being isolated on small, barren islands or scattered throughout the ocean, puffins don’t have many predators. Being separate from the main masses allows them to remain safe from creatures such as dogs, cats, weasels, and foxes. At the ocean, predators come in from above or below. Larger birds such as the Great Suka can often attack puffins mid-flight, while seals and even some sharks have been able to eat puffins underwater. \n\nDespite these natural threats, the biggest threat to puffins is, well, us. In 2015, the Atlantic Puffin’s conservation status was recently changed from Least Concern to Vulnerable, a sign of declining puffin populations throughout the world. Ocean pollution, such as oil spills, has led to great losses of puffin habitat throughout much of Scandinavia, while climate change has caused puffins to become restricted to places that are still cold enough for their lifestyle, as glaciers and ice caps continue to melt. With all of these factors, current trends estimate that the European population of puffins will decline by 50–79% between 2000 and 2065. \n\nFortunately, there have been significant efforts to revive Puffin populations worldwide - and many of them are seeing great progress! Hunting puffins used to be a popular pastime & way to get food throughout the 20th century and earlier, but many countries, such as Iceland, have now outlawed the practice. Additionally, organizations such as SOS Puffin have been created to revitalize puffin populations among islands that used to have breeding colonies but currently do not. Other efforts include cleaning up pollution and other waste throughout oceans and puffin breeding grounds, and efforts to reintroduce Puffins to other areas across the world. \n\nIn the end, Atlantic Puffins are more than just “clowns of the sea” — they’re tough, colorful little survivors braving icy waters and rocky cliffs. Let’s hope our efforts help keep these charming birds around for generations to come!"
    }
]